{
    "code": 200,
    "data": {
        "size": 10,
        "nextPage": "http:\/\/api.sportskeeda.com\/v2\/content-feed-json?pageNumber=2",
        "pageSize": 20,
        "rows": [
            {
                "title": "How the Telugu Titans can qualify for the playoffs of VIVO PKL 6",
                "thumbnail": "https:\/\/static.sportskeeda.com\/editor\/2018\/12\/ae59c-15444443515361-800.jpg",
                "created_date": "2018-12-10 20:23:48",
                "modified_date": "2018-12-10 20:23:48",
                "post_date": "Dec 10 2018",
                "TYPE": "article",
                "summary": "Currently, Telugu Titans are placed 3rd in the Zone B points table and have a slender 1 point lead over the 4th placed Bengal Warriors. ",
                "author_name": "Vinay Chhabaria",
                "id": 3027203,
                "language": "English",
                "category": "Sports",
                "subcategory": "Kabaddi",
                "keywords": "",
                "description": "Currently, Telugu Titans are placed 3rd in the Zone B points table and have a slender 1 point lead over the 4th placed Bengal Warriors. ",
                "pages": [
                    {
                        "pageNumber": 1,
                        "pageContent": "<p>&#8203;<\/p><figure class= \"image\"><img src=\"https:\/\/static.sportskeeda.com\/editor\/2018\/12\/ae59c-15444443515361-800.jpg\" alt=\"The Telugu Titans are currently playing their home leg\" \/><figcaption>The Telugu Titans are currently playing their home leg<\/figcaption><\/figure><p>Telugu Titans is undoubtedly one of the most popular franchises of the Pro Kabaddi League and that fact can be acknowledged at the ongoing home leg of the team where thousands of fans turn up at Vizag irrespective of the team's performance. <\/p><p>Despite having the poster boy of PKL, Rahul Chaudhari in their team the Telugu Titans have failed to even make it to the final even once. Their best performance has been a third place finish and given the talent in their team, they certainly deserve a better position.<\/p><p>Currently, there are placed 3rd in the Zone B points table and have a slender 1 point lead over the 4th placed Bengal Warriors. The Titans still have 6 matches left in the group stage including 3 of their home leg. With all 6 teams of Zone B in reckoning of a play-off spot, here's how the Telugu Titans can make it to the 2nd round of the sixth season of PKL -<\/p><p>In the Zone B points table, Bengaluru Bulls seemed to have locked their play-off position as they have 59 points to their name in just 17 matches. The second and third positions are wide open with Bengal Warriors, Patna Pirates and Telugu Titans being the top contenders for the 2 positions.<\/p><p>Patna Pirates are 7 points ahead of Telugu Titans but have played one match more than the Titans. The maximum number of points that Patna could have at the end of group stage is 76. While, the maximum number of points that Telugu Titans could have at the end is 74. On the other hand, fifth and sixth placed teams UP Yoddha and Tamil Thalaivas are almost out of the race with just 34 points each. UP can have a maximum 59 points by the end of league while Tamil Thalaivas can only have 54 points. So, these two teams may not be causing troubles in Titans' road to play-offs.<\/p><p>&#8203;<\/p><figure class= \"image\"><img src=\"https:\/\/static.sportskeeda.com\/editor\/2018\/12\/b64ec-15444457442664-800.jpg\" alt=\"Titans will clash with UP Yoddha next\" \/><figcaption>Titans will clash with UP Yoddha next<\/figcaption><\/figure><p>For Telugu Titans to make it to the play-offs, they need to win their matches against the Patna Pirates and Bengal Warriors as they are their prime competitors. Losing against any of the two sides would give their rivals the upper hand in the race. Bengal have to still play their home leg and a lot will depend on their performance at Kolkata.<\/p><p>Vizag should concentrate on winning all the 3 matches of their home leg and win 1 or 2 of the remaining 3 games to seal their play-off spot. A third place finish is likely for the Telugu Titans in the Zone B. However, if they fail in their home leg, their wild-card match against Puneri Paltan and the last match against the Bengal Warriors would become do or die for the Vishal Bhardwaj led team.<\/p><p>&#8203;<\/p>",
                        "originalUrl": "https:\/\/www.sportskeeda.com\/kabaddi\/how-the-telugu-titans-can-qualify-for-the-playoffs-of-vivo-pkl-6"
                    }
                ],
                "tags": [],
                "detailUrl": "https:\/\/www.sportskeeda.com\/kabaddi\/how-the-telugu-titans-can-qualify-for-the-playoffs-of-vivo-pkl-6",
                "articleFrom": "Sportskeeda",
                "publishTime": 1544453628000,
                "createTime": 1544453628000,
                "coverPic": [
                    "https:\/\/static.sportskeeda.com\/editor\/2018\/12\/ae59c-15444443515361-800.jpg"
                ],
                "province": "",
                "city": ""
            },
            {
                "title": "Premier League 2018-19: Is it now a 3-horse race for the title?",
                "thumbnail": "https:\/\/static.sportskeeda.com\/editor\/2018\/12\/dbc85-15444515344531-800.jpg",
                "created_date": "2018-12-10 20:23:41",
                "modified_date": "2018-12-10 20:23:41",
                "post_date": "Dec 10 2018",
                "TYPE": "article",
                "summary": "Manchester City, Chelsea and Liverpool are closely matched in talent and a scramble for the league title is looking more and more plausible.",
                "author_name": "rehaan díaz",
                "id": 3027252,
                "language": "English",
                "category": "Sports",
                "subcategory": "Football",
                "keywords": "",
                "description": "Manchester City, Chelsea and Liverpool are closely matched in talent and a scramble for the league title is looking more and more plausible.",
                "pages": [
                    {
                        "pageNumber": 1,
                        "pageContent": "<p> <\/p><figure class= \"image\"><img src=\"https:\/\/static.sportskeeda.com\/editor\/2018\/12\/dbc85-15444515344531-800.jpg\" alt=\"Manchester City face tougher competition to defend their title this time\" \/><figcaption>Manchester City face tougher competition to defend their title this time<\/figcaption><\/figure><p>Last weekend was definitely an important one in the twists and turns this year in the English Premier League (EPL). Manchester City lost 2-0 to Chelsea that halted their momentum a bit and brought Maurizio Sarri's side right back into title contention following patchy defeats to Wolves and Spurs. Pep Guardiola was a little irked at the press in a defeat that also signals that the Premier League would be harder to win this season.<\/p><p>&#8203;<\/p><blockquote>\"You don’t have to tell me how competitive this league is. It’s you and your analysts that keep saying we are invincible, that we are perfect and that, in February, we are going to win the league. You said that. All of you. Not the manager, not any player, not the club.”<\/blockquote><figure class= \"image\"><img src=\"https:\/\/static.sportskeeda.com\/editor\/2018\/12\/d2be2-15444511496592-800.jpg\" alt=\"David Luiz celebrates his goal that gave Chelsea a stunning win over the defending champions\" \/><figcaption>David Luiz celebrates his goal that gave Chelsea a stunning win over the defending champions<\/figcaption><\/figure><p>&#8203;<\/p><p>Manchester City were shocked at the Stamford Bridge by Chelsea in a display that bodes well for the league. Guardiola, to be fair has always maintained that the title will be very difficult to defend and in fact welcomes the increased competition in the shape of Liverpool primarily. After 16 rounds, Jürgen Klopp’s side is the only unbeaten one left in the EPL; and as things stand, Tottenham and Arsenal are at a touching distance too.<\/p><p>How the Champions League groups end up is also of consequence as Liverpool and Tottenham are precariously placed in their groups. They can get knocked out and join Arsenal, Chelsea in the Europa League. Going deep into either Europa or Champions League puts a lot of strain on the league campaign. Manchester City bear the added pressure of being anointed the ‘best side in Europe’ and their coach would want to mount a serious challenge this season as the traditional powerhouses Real Madrid and Bayern Munich are not as strong as before.<\/p><p>All this rounds up to the question of who really is best placed to win the league? While Tottenham sit third, they are not playing at their home ground yet and are suspect to inconsistency. Arsenal under Unai Emery has been a revelation with a newly grown spine, and yet a title shot may just be too much to handle. That leaves only Chelsea to challenge the top 2, who are separated by a single point (42-41).<\/p><figure class= \"image\"><img src=\"https:\/\/static.sportskeeda.com\/editor\/2018\/12\/1440d-15444531402395-800.jpg\" alt=\"Liverpool are menacing and currently at the top of the league by a single point\" \/><figcaption>Liverpool are menacing and currently at the top of the league by a single point<\/figcaption><\/figure><p>&#8203;<\/p><p>Not even Guardiola with his tactical nous could conquer the league in the first time of asking and struggled in his debut 2016-17. Antonio Conte did though the same year with Chelsea. While equally capable, Maurizio Sarri may just be a few key players short to emulate that. The top teams are closer in talent and personnel than before and as always the unpredictability of the teams further down makes for a situation that can flip and flop multiple times until the fag end of the season.<\/p><p>It does come down then to Liverpool, title-less since 1990 and who courted Jürgen Klopp to Anfield to deliver one, the first one in the modern era. Klopp has stated that he wanted to win within 4 years and 2019 marks his fourth year.<\/p><p><iframe style=\"max-width:100%\" width=\"500\" height=\"281\" src=\"https:\/\/www.youtube.com\/embed\/bzq1GSFR6bQ\" frameborder=\"0\" allowfullscreen><\/iframe><\/p><p>Whatever comes off the forthcoming frenetic December fixtures, Liverpool-Manchester City-Chelsea are going to be locked in a battle of attrition. The last time the title was decided on the last day in 2011-12 when City clinched it win an injury-time winner by Sergio Agüero. We can expect a scramble until the last day, surely. The indications point to it.<\/p><p> <\/p><p>&#8203;<\/p>",
                        "originalUrl": "https:\/\/www.sportskeeda.com\/football\/premier-league-2018-19-is-it-now-a-3-horse-race-for-the-title"
                    }
                ],
                "tags": [],
                "detailUrl": "https:\/\/www.sportskeeda.com\/football\/premier-league-2018-19-is-it-now-a-3-horse-race-for-the-title",
                "articleFrom": "Sportskeeda",
                "publishTime": 1544453621000,
                "createTime": 1544453621000,
                "coverPic": [
                    "https:\/\/static.sportskeeda.com\/editor\/2018\/12\/dbc85-15444515344531-800.jpg"
                ],
                "province": "",
                "city": ""
            },
            {
                "title": "PBL 2018, North Eastern Warriors: Time Table, Schedule, Venue Details and Match Timings",
                "thumbnail": "https:\/\/static.sportskeeda.com\/editor\/2018\/12\/ab5b5-15444528731504-800.jpg",
                "created_date": "2018-12-10 20:20:18",
                "modified_date": "2018-12-10 20:20:18",
                "post_date": "Dec 10 2018",
                "TYPE": "article",
                "summary": "Get the complete schedule of North Eastern Warriors for the Premier Badminton League 2018",
                "author_name": "Rishikesh Malkhede",
                "id": 3027262,
                "language": "English",
                "category": "Sports",
                "subcategory": "Badminton",
                "keywords": "",
                "description": "Get the complete schedule of North Eastern Warriors for the Premier Badminton League 2018",
                "pages": [
                    {
                        "pageNumber": 1,
                        "pageContent": "<p align=\"justify\">With the Premier Badminton League 2018 set to start from 22 December 2018, all nine teams along with the debutant Pune 7 Aces will have their eyes focused at the title. The tournament will feature the top 5 ranked World Badminton players along with many other masters of the sport.<\/p><figure class= \"image\"><img src=\"https:\/\/static.sportskeeda.com\/editor\/2018\/12\/ab5b5-15444528731504-800.jpg\" alt=\"Saina Nehwal will be the face of North Eastern Warriors in PBL 2018\" \/><figcaption>Saina Nehwal will be the face of North Eastern Warriors in PBL 2018<\/figcaption><\/figure><p align=\"justify\"><\/p><p align=\"justify\">It will be the second season for North Eastern Warriors and with a big investment of Rs. 80 lakhs for Olympic medalist Saina Nehwal in the squad, the Warriors have laid their plans loud and clear.<\/p><p align=\"justify\">The 10-player squad will be lead by Nehwal. She will be joined by Rituparna Das in the women’s singles competition. On the other side, Siril Verma, Tian Houwei and Thailand’s first man to win a men's singles title in a Super Series Premier tournament, Tanongsak Saensomboonsuk, will be looking to top the men’s singles division.<\/p><p align=\"justify\">The Warriors have a strong Doubles squad ready to take on any other pair. It is filled with talented players like Yoo Yeon Seong, Kim Ha Na, Liao Min Chun, K Maneesha and team’s youngest Dhruv Kapila.<\/p><p align=\"justify\">After failing to make a major impact in their debut season, the revamped North Eastern Warriors along with the new coach Edwin Iriawan will look to achieve big and take some silverware home this season. They will be looking to clench their first victory against Ahmedabad Smash Masters on 23rd of December.<\/p><hr><\/hr><p align=\"justify\">Here is the full schedule of the North Easters Warriors’ PBL 2018 campaign:<\/p><p><strong>Match #1<\/strong><\/p><p>Date: 23 December 2018<\/p><p>Opponent: Ahmedabad Smash Masters<\/p><p>City: The National Sports Club of India, Mumbai<\/p><p>Timing (IST): 1900 hrs<\/p><p><strong>Match #2<\/strong><\/p><p>Date: 26 December 2018<\/p><p>Opponent: Delhi Dashers<\/p><p>City: Gachibowli Indoor Stadium, Hyderabad<\/p><p>Timing (IST): 1900 hrs<\/p><p><strong>Match #3<\/strong><\/p><p>Date: 27 December 2018<\/p><p>Opponent: Mumbai Rockets<\/p><p>City: Gachibowli Indoor Stadium, Hyderabad<\/p><p>Timing (IST): 1900 hrs<\/p><p><strong>Match #4<\/strong><\/p><p>Date: 29 December 2018<\/p><p>Opponent: Delhi Dashers<\/p><p>City: Shree Shiv Chhatrapati Sports Complex, Pune<\/p><p>Timing (IST): 1900 hrs<\/p><p><strong>Match #5<\/strong><\/p><p>Date: 01 January 2018<\/p><p>Opponent: Hyderabad Hunters<\/p><p>City: Shree Shiv Chhatrapati Sports Complex, Pune<\/p><p>Timing (IST): 1900 hrs<\/p><p><strong>Match #6<\/strong><\/p><p>Date: 05 January 2018<\/p><p>Opponent: Bengaluru Raptors<\/p><p>City: The Arena by SE TransStadia, Ahmedabad<\/p><p>Timing (IST): 1900 hrs<\/p><p><strong>Match #7<\/strong><\/p><p>Date: 09 January 2018<\/p><p>Opponent: Awadhe Warriors<\/p><p>City: Kanteerava Indoor Stadium, Bengaluru<\/p><p>Timing (IST): 1900 hrs<\/p><hr><\/hr><p>(With inputs from Chitransh Popli)<\/p><p><strong><em>Follow Sportskeeda to get the latest news from <\/em><\/strong><strong><em><a href=\"https:\/\/www.sportskeeda.com\/go\/premier-badminton-league\" target=\"_blank\">Premier Badminton League 2018<\/a><\/em><\/strong><\/p><p>&#8203;<\/p>",
                        "originalUrl": "https:\/\/www.sportskeeda.com\/badminton\/pbl-2018-north-eastern-warriors-time-table-schedule-venue-details-and-match-timings"
                    }
                ],
                "tags": [],
                "detailUrl": "https:\/\/www.sportskeeda.com\/badminton\/pbl-2018-north-eastern-warriors-time-table-schedule-venue-details-and-match-timings",
                "articleFrom": "Sportskeeda",
                "publishTime": 1544453418000,
                "createTime": 1544453418000,
                "coverPic": [
                    "https:\/\/static.sportskeeda.com\/editor\/2018\/12\/ab5b5-15444528731504-800.jpg"
                ],
                "province": "",
                "city": ""
            },
            {
                "title": "3 former Barcelona players who have reservations about Pep Guardiola",
                "thumbnail": "https:\/\/static.sportskeeda.com\/editor\/2018\/12\/31322-15444489662788-800.jpg",
                "created_date": "2018-12-10 20:17:00",
                "modified_date": "2018-12-10 20:17:00",
                "post_date": "Dec 10 2018",
                "TYPE": "article",
                "summary": "A list of former Barcelona players who have feuded with Pep Guardiola.",
                "author_name": "Suman Dey",
                "id": 3027230,
                "language": "English",
                "category": "Sports",
                "subcategory": "Football",
                "keywords": "",
                "description": "A list of former Barcelona players who have feuded with Pep Guardiola.",
                "pages": [
                    {
                        "pageNumber": 1,
                        "pageContent": "<p>&#8203;<\/p><figure class= \"image\"><img src=\"https:\/\/static.sportskeeda.com\/editor\/2018\/12\/31322-15444489662788-800.jpg\" alt=\"Not everyone likes Pep Guardiola\" \/><figcaption>Not everyone likes Pep Guardiola<\/figcaption><\/figure><p>Pep Guardiola is arguably the master of beautiful football. The former Barcelona man has had a successful managerial career, having won every major trophy available. He's regarded as one of the best managers in the world, and some even consider him the best manager ever. <\/p><p>The Spaniard became famous with his tiki-taka football in Barcelona, as the Catalans were nearly untouchable during his tenure, and even gave their arch-rivals, Real Madrid, a 5-0 thrashing. His second venture with Bayern Munich was also a successful one, winning the Bundesliga title on all three occasions. <\/p><p>The former Barcelona boss is currently at Manchester City where he has changed the dynamic of English football altogether. Last season, City broke the points tally, reaching 100 points in the league. <\/p><p>However, what stands out is the brand of football the blue half of Manchester City is showcasing at the moment. They are hard to beat, and are well on course to successfully retain the Premier League.<\/p><p>A man like Pep Guardiola who is so much praised by the footballing world is not short of haters either. He has been criticised for shutting players out, players he didn't fancy at all. Here is a list of three former Barcelona players who don't seem to be on the good books of the Spaniard.<\/p><hr><\/hr><h3>#3 Yaya Toure<\/h3><figure class= \"image\"><img src=\"https:\/\/static.sportskeeda.com\/editor\/2018\/12\/4e5a0-15444490000664-800.jpg\" alt=\"Toure suffered under Guardiola, both at Barcelona and Manchester City\" \/><figcaption>Toure suffered under Guardiola, both at Barcelona and Manchester City<\/figcaption><\/figure><p>Guardiola is the dream manager of almost every player in the world. However, one man who will be glad never to have to play under him again is Yaya Toure. <\/p><p>At 23, the Ivorian midfielder was at Olympiacos, emerging as one of the brightest prospects in Europe, and drawing the attention of top clubs in the world. A Barca deal got finalised, and Toure became the trusted defensive anchor behind Xavi and Deco. But when Pep took over, things changed.<\/p><p>Pep sold Ronaldinho & Deco, and brought in the likes of Pedro and Busquets. The arrival of the Spanish midfielder eventually resulted in Toure's downfall. This left Toure aggravated, and he moved to City, claiming Pep didn't care about him until the transfer offer came in. <\/p><p>Years later, they reunited again at City where Yaya again found himself on the bench. He left Manchester City before the start of the current campaign. <\/p><p>&#8203;<\/p><!--nextpage--><h3>#2 Samuel Eto'o<\/h3><figure class= \"image\"><img src=\"https:\/\/static.sportskeeda.com\/editor\/2018\/12\/ba753-15444490580987-800.jpg\" alt=\"Eto didn't like Pep's bossy nature\" \/><figcaption>Eto didn't like Pep's bossy nature<\/figcaption><\/figure><p>Samuel Eto'o was one of the most feared strikers of his generation. He won the treble for Barcelona under Guardiola, and another one with Inter Milan under Jose Mourinho. Across the two campaigns, the Cameroonian professional footballer scored a total of 52 goals. <\/p><p>Despite Pep Guardiola winning LaLiga and the Champions League in his first season at Barcelona, Eto'o felt the manager had proved nothing. The former Chelsea man felt slighted about being told what to do. <\/p><p>Eto'o didn't like Pep lecturing him about how a striker should play when Guardiola himself was a midfielder as a player. Both of them <a href=\"http:\/\/en.espn.co.uk\/football\/sport\/story\/294417.html\" target=\"_blank\">reportedly <\/a>spoke only few times throughout their season together, before Samuel moved to Italy. That was also the only campaign Eto'o crossed 30 league goals.<\/p><p>&#8203;<\/p><!--nextpage--><h3>#1 Zlatan Ibrahimovic<\/h3><figure class= \"image\"><img src=\"https:\/\/static.sportskeeda.com\/editor\/2018\/12\/d9282-15444490924188-800.jpg\" alt=\"Zlatan could never stand the sight of the Spaniard\" \/><figcaption>Zlatan could never stand the sight of the Spaniard<\/figcaption><\/figure><p>Zlatan is arguably one of the best players ever to grace the footballing pitch. He is a serial winner who has won in every country and every club he has played. However, his career at Barcelona ended on a somewhat frustrating note.<\/p><p>The Swedish international has a big ego, and he doesn't like someone getting the better of him. His war of words with Pep during their Barcelona days grabbed headlines across the continent. It all started after Pep's first season and treble-winning campaign with Barcelona.<\/p><p>Pep wanted to add more big names to his side, and so Zlatan was brought in from Inter Milan, with Eto'o going the other way. However, being shifted out wide for arguably the greatest player in history, Lionel Messi, didn't go down well with Ibrahimovic. He reportedly called Guardiola <em>a coward with no guts<\/em>. <\/p><p>Despite the animosity between the duo, Zlatan does consider Pep a great manager.<\/p><p>&#8203;<\/p>",
                        "originalUrl": "https:\/\/www.sportskeeda.com\/football\/3-former-barcelona-players-who-have-reservations-about-pep-guardiola-ss"
                    }
                ],
                "tags": [],
                "detailUrl": "https:\/\/www.sportskeeda.com\/football\/3-former-barcelona-players-who-have-reservations-about-pep-guardiola-ss",
                "articleFrom": "Sportskeeda",
                "publishTime": 1544453220000,
                "createTime": 1544453220000,
                "coverPic": [
                    "https:\/\/static.sportskeeda.com\/editor\/2018\/12\/31322-15444489662788-800.jpg"
                ],
                "province": "",
                "city": ""
            },
            {
                "title": "I-League 2018-19: East Bengal sign Antonio Dovale as replacement for injured Al-Amna",
                "thumbnail": "https:\/\/static.sportskeeda.com\/editor\/2018\/12\/689b2-15444519035493-800.jpg",
                "created_date": "2018-12-10 20:15:04",
                "modified_date": "2018-12-10 20:15:04",
                "post_date": "Dec 10 2018",
                "TYPE": "article",
                "summary": "Dovale previously represented Bengaluru FC in the Indian Super League.",
                "author_name": "Avik Roy",
                "id": 3027249,
                "language": "English",
                "category": "Sports",
                "subcategory": "Football",
                "keywords": "",
                "description": "Dovale previously represented Bengaluru FC in the Indian Super League.",
                "pages": [
                    {
                        "pageNumber": 1,
                        "pageContent": "<p>&#8203;<\/p><figure class= \"image\"><img src=\"https:\/\/static.sportskeeda.com\/editor\/2018\/12\/689b2-15444519035493-800.jpg\" alt=\"Dovale during his time in Bengaluru FC\" \/><figcaption>Dovale during his time in Bengaluru FC<\/figcaption><\/figure><p><a href=\"https:\/\/www.sportskeeda.com\/team\/east-bengal\" target=\"_blank\">East Bengal<\/a> have signed Antonio Rogriguez Dovale, commonly known as Toni, for the rest of the season. The Spaniard replaces Syrian playmaker Mahmoud Al-Amna, who was released by the club a couple of days ago.<\/p><p>Toni, who plied his trade for Bengaluru FC last season in the Indian Super League, left the club at the end of the season and joined Cypriot top flight club Nea Salamina, where many Spanish footballers play.<\/p><p>But that turned out to be a disaster for the talented winger who didn't play a single match for his new club. Nea Salamina currently stand at the sixth position of the league table with 19 points from 12 matches.<\/p><p>Dovale has fallen out of favour with coach Savvas Poursaitidis and when a call came from East Bengal, he couldn’t ignore it. He will in all likelihood arrive at Kolkata by December 14.<\/p><p>During his time with Bengaluru FC, he played 13 matches in the ISL and helped the team reach the final of the tournament. But his real talent was on display in the AFC Cup, where he was deployed in a more attacking role by the then Bangaluru coach Albert Roca, scoring three times in four games.<\/p><p>Dovale started his youth career at local club Ural CF and spent four years at Barcelona's academy. He then joined Celta B and was promoted to the senior team subsequently, where he played under Luis Enrique, the current Spanish national team coach.<\/p><p>However, he was deployed on the left side, which he failed to enjoy much success. As a result, he was continuously omitted from the first team squad, which forced him to quit the club. After spending two years at Sporting Kansas City and Lugo, Dovale came back to La Liga and joined Leganes. He was signed by Rayo Vallecano after two seasons at Leganes and last season, joined Bengaluru FC.<\/p><p>East Bengal, meanwhile, have lacked creativity in the midfield in the absence of a proper playmaker. Al-Amna played well in the Calcutta Football League but he injured himself in pre-season training camp in Malaysia. As he failed to recover in time, the club decided to release the Syrian with the official confirmation coming on Monday.<\/p><p>In other news involving the club, Mexican striker Enrique Esqueda picked up an injury in the match against Gokulam Kerala FC. The Mexican fractured his rib, which will take at least eight weeks to heal. That means he will not be available until February.<\/p><p>The club are pondering whether to release him but the coach has opposed any such move.<\/p><p>&#8203;<\/p>",
                        "originalUrl": "https:\/\/www.sportskeeda.com\/football\/i-league-2018-19-east-bengal-sign-toni-dovale-as-a-replacement-for-al-amna"
                    }
                ],
                "tags": [],
                "detailUrl": "https:\/\/www.sportskeeda.com\/football\/i-league-2018-19-east-bengal-sign-toni-dovale-as-a-replacement-for-al-amna",
                "articleFrom": "Sportskeeda",
                "publishTime": 1544453104000,
                "createTime": 1544453104000,
                "coverPic": [
                    "https:\/\/static.sportskeeda.com\/editor\/2018\/12\/689b2-15444519035493-800.jpg"
                ],
                "province": "",
                "city": ""
            },
            {
                "title": "WWE RAW Preview: 10th December 2018",
                "thumbnail": "https:\/\/static.sportskeeda.com\/editor\/2018\/12\/fd195-15444433470171-800.jpg",
                "created_date": "2018-12-10 20:11:25",
                "modified_date": "2018-12-10 20:11:25",
                "post_date": "Dec 10 2018",
                "TYPE": "slideshow",
                "summary": "A huge press conference has been announced while Ambrose and Rollins have their final face-off! ",
                "author_name": "Rohit Nath",
                "id": 3027255,
                "language": "English",
                "category": "Sports",
                "subcategory": "WWE",
                "keywords": "",
                "description": "A huge press conference has been announced while Ambrose and Rollins have their final face-off! ",
                "pages": [
                    {
                        "pageNumber": 1,
                        "pageContent": "<p>&#8203;<\/p><figure class= \"image\"><img src=\"https:\/\/static.sportskeeda.com\/editor\/2018\/12\/fd195-15444433470171-800.jpg\" alt=\"Is Dean Ambrose in Seth Rollins' head?\" \/><figcaption>Is Dean Ambrose in Seth Rollins' head?<\/figcaption><\/figure><p>Last week's <em><a href=\"https:\/\/www.sportskeeda.com\/wwe\" target=\"_blank\">RAW<\/a><\/em><em> <\/em>was a steady improvement from the week prior. Last week was <em>supposed <\/em>to kick off with Ronda Rousey teaming with Natalya to take on Nia Jax and Tamina, but the Riott Squad interfered before the match could even start and put Natalya through a table.<\/p><p>Rousey, meanwhile, had her match postponed to the main event and instead of choosing Alexa Bliss' hand-picked partner, she found Ember Moon to team with her. It turned out to be a great pick as they picked up the victory.<\/p><p>Dean Ambrose came out in unusual fashion, wearing a gas mask. He had a brawl with Rollins, which saw him come out on top. Dolph Ziggler's alliance with Drew McIntyre officially came to a halt and Ziggler picked up a surprise win over McIntyre, becoming the first person to pin him in over a year (thanks to a little assistance from Finn Balor).<\/p><p>Rhyno was fired from RAW after losing to Heath Slater (who Corbin later revealed would be a referee). A lot more happened, but let's stop looking back and see what's there to look forward to on <em>RAW <\/em>tonight!<\/p><hr><\/hr><h3>Alexa Bliss holds a TLC press conference<\/h3><figure class= \"image\"><img src=\"https:\/\/static.sportskeeda.com\/editor\/2018\/12\/cd6fd-15444441676062-800.jpg\" alt=\"Alexa Bliss has taken over the watch on the Women's division\" \/><figcaption>Alexa Bliss has taken over the watch on the Women's division<\/figcaption><\/figure><p>For the last couple of weeks since being named as the manager of the RAW Women's Division, Alexa Bliss has hosted two \"open forums\" featuring Sasha Banks and Bayley, both of which ended rather unsuccessfully. The first week saw Sasha Banks and Bayley clear off a set of rivals from the ring while last week saw them comfortably defeat Mickie James and Alicia Fox.<\/p><p>Bayley even teased new tag team titles! This week, WWE is taking a page off UFC's playbook and hosting a press conference in the Women's Division. Who's going to be present and what's going to go down?<\/p><p>&#8203;<\/p><div class=\"sportskeeda-embed\" data-src=\"twitter\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Since taking over the <a href=\"https:\/\/twitter.com\/hashtag\/Raw?src=hash&amp;ref_src=twsrc%5Etfw\">#Raw<\/a> Women’s division, I’ve put our female Superstars at the forefront of <a href=\"https:\/\/twitter.com\/WWE?ref_src=twsrc%5Etfw\">@WWE<\/a>. So before <a href=\"https:\/\/twitter.com\/NiaJaxWWE?ref_src=twsrc%5Etfw\">@NiaJaxWWE<\/a> and <a href=\"https:\/\/twitter.com\/RondaRousey?ref_src=twsrc%5Etfw\">@RondaRousey<\/a> face off at <a href=\"https:\/\/twitter.com\/hashtag\/WWETLC?src=hash&amp;ref_src=twsrc%5Etfw\">#WWETLC<\/a>, I’m holding a press conference and may actually use some of YOUR questions. Use <a href=\"https:\/\/twitter.com\/hashtag\/AskAlexa?src=hash&amp;ref_src=twsrc%5Etfw\">#AskAlexa<\/a><br>...and make them good. <a href=\"https:\/\/t.co\/ZbXEDFTxQB\">pic.twitter.com\/ZbXEDFTxQB<\/a><\/p>— Lexi Kaufman (@AlexaBliss_WWE) <a href=\"https:\/\/twitter.com\/AlexaBliss_WWE\/status\/1071058869500170240?ref_src=twsrc%5Etfw\">December 7, 2018<\/a><\/blockquote><\/div><p>&#8203;<\/p><!--nextpage--><h3>The Scottish Psychopath seeks retribution<\/h3><figure class= \"image\"><img src=\"https:\/\/static.sportskeeda.com\/editor\/2018\/12\/fe640-15444456016726-800.jpg\" alt=\"Drew McIntyre suffered his first pinfall loss since his main roster return\" \/><figcaption>Drew McIntyre suffered his first pinfall loss since his main roster return<\/figcaption><\/figure><p>Last week, Acting RAW General Manager Baron Corbin hosted a \"Drew McIntyre appreciation night\", awarding him the first gold medal in RAW history (seemingly a shot at the <em>real <\/em>GM Kurt Angle).<\/p><p>Dolph Ziggler came out and questioned McIntyre, who claimed that he just used Ziggler as a means to get forward. We can't exactly say that it came as a surprise given that we <em>knew <\/em>McIntyre would turn on Ziggler at some point.<\/p><p>They had a match (which, for some reason, was not on PPV) and Finn Balor, McIntyre's TLC opponent interfered and ultimately cost <em>The Scottish Psychopath<\/em>. Ziggler got a measure of revenge while Balor looked on with amusement.<\/p><p>He did get a beating at the hands of McIntyre afterward backstage, but the <em>Scottish Psychopath <\/em>won't be done dishing out the punishment. Ziggler and Balor are in big trouble.<\/p><p>&#8203;<\/p><!--nextpage--><h3>Heath Slater gets a fresh start<\/h3><p>&#8203;<\/p><figure class= \"image\"><img src=\"https:\/\/static.sportskeeda.com\/editor\/2018\/12\/b2b40-15444460626859-800.jpg\" alt=\"Heath Slater's new role is not as a competitor\" \/><figcaption>Heath Slater's new role is not as a competitor<\/figcaption><\/figure><p>Last week, Baron Corbin called in Heath Slater and Rhyno to his office and told them that after \"crunching numbers\", he found that there was only space for one of them on the roster. He cruelly suggested that one of them give up their jobs to save the other, but both of them seemed unwilling.<\/p><p>Knowing this would happen, Corbin put them up against each other in a match, with the loser getting fired from RAW. Slater got a quick win but was clearly dejected at Rhyno's fate. When asking Corbin if there was any way he could help his now former partner, Corbin told him that he can do <em>his job<\/em>.<\/p><p>He then handed him a referee's uniform, revealing that Slater isn't signed to RAW as a competitor anymore. He's now a referee and gets a fresh start. But what's going to happen going forward? Is <strong>Slater set for another push?<\/strong><\/p><p>&#8203;<\/p><!--nextpage--><h3>Natalya has a bone to pick with the Riott Squad<\/h3><p>&#8203;<\/p><figure class= \"image\"><img src=\"https:\/\/static.sportskeeda.com\/editor\/2018\/12\/6a3e5-15444463624999-800.jpg\" alt=\"Enter caption\" \/><\/figure><p>Last week before their much-anticipated match-up against Nia Jax and Tamina, Ronda Rousey and Natalya were ambushed by the Riott Squad. The ruthless trio set their focus on Natalya and sent her crashing through a table.<\/p><p>Late last week, WWE announced that Natalya would be taking on Ruby Riott in a Tables match at TLC. This is going to be interesting, because it might be Natalya's shot at revenge. She's been in crosshairs with the Riott Squad for a while now and she seemingly has no other ally except for Ronda Rousey.<\/p><p>With Rousey busy focusing her attention on Nia Jax (and Tamina as an added package), who will Natalya find to help her face the numbers of the Riott Squad? The only real answer we can think of is Ember Moon, whose role at the moment appears to be helping others out without much direction herself.<\/p><p>&#8203;<\/p><!--nextpage--><h3>The final standoff between The Lunatic and The Architect<\/h3><figure class= \"image\"><img src=\"https:\/\/static.sportskeeda.com\/editor\/2018\/12\/b69c7-15444467378269-800.jpg\" alt=\"WWE Photo\" \/><\/figure><p>In less than a week, Seth Rollins and Dean Ambrose face off in a long-awaited match-up with the Intercontinental Championship on the line. Last week, Dean Ambrose came out with a gas mask and once again, began trashing the WWE Universe.<\/p><p>The WWE Universe got irate with <em>The Lunatic Fringe <\/em>and loudly chanted for Rollins, who was happy to oblige. This resulted in a brawl that saw Ambrose and his SWAT henchmen get the better of <em>The Architect<\/em>, hitting Dirty Deeds twice before walking away.<\/p><p>With the final stand off this week, the question remains - is Dean Ambrose in Rollins' head? What antics will Ambrose pull this time in an attempt at mindgames? Lastly, who's going to stand tall in their final face-off?<\/p><p>This match is very likely going to be <strong>the main event of TLC. <\/strong>Also, don't expect Renee Young to give any answers!<\/p><p>&#8203;<\/p>",
                        "originalUrl": "https:\/\/www.sportskeeda.com\/wwe\/wwe-raw-preview-10th-december-2018-ss"
                    }
                ],
                "tags": [],
                "detailUrl": "https:\/\/www.sportskeeda.com\/wwe\/wwe-raw-preview-10th-december-2018-ss",
                "articleFrom": "Sportskeeda",
                "publishTime": 1544452885000,
                "createTime": 1544452885000,
                "coverPic": [
                    "https:\/\/static.sportskeeda.com\/editor\/2018\/12\/fd195-15444433470171-800.jpg"
                ],
                "province": "",
                "city": ""
            },
            {
                "title": "NBA Rumor: Chicago Bulls' players hold a meeting and nearly skip practice",
                "thumbnail": "https:\/\/static.sportskeeda.com\/editor\/2018\/12\/d4da4-15444478621503-800.jpg",
                "created_date": "2018-12-10 20:10:00",
                "modified_date": "2018-12-10 20:10:00",
                "post_date": "Dec 10 2018",
                "TYPE": "article",
                "summary": "Players are reportedly not happy with the coaching style of Boylen.",
                "author_name": "Shubham Sharma",
                "id": 3027219,
                "language": "English",
                "category": "Sports",
                "subcategory": "Basketball",
                "keywords": "",
                "description": "Players are reportedly not happy with the coaching style of Boylen.",
                "pages": [
                    {
                        "pageNumber": 1,
                        "pageContent": "<p>&#8203;<\/p><figure class= \"image\"><img src=\"https:\/\/static.sportskeeda.com\/editor\/2018\/12\/d4da4-15444478621503-800.jpg\" alt=\"Bulls recently lost to Celtics by 56 points\" \/><figcaption>Bulls recently lost to Celtics by 56 points<\/figcaption><\/figure><p><a href=\"https:\/\/www.sportskeeda.com\/team\/chicago-bulls\" target=\"_blank\">Chicago Bulls<\/a> are 6-21 for the season and are currently sitting at the last place in the eastern conference. They had a recent change in the coaching area with Jim Boylen coming in as the new coach for them. But things have not started as he would have liked.<\/p><p>Jim has an aggressive approach towards the game and especially towards the training sessions and conditioning. <\/p><p>The moment he took over the job, he started pushing guys harder as he was not happy with the previously followed methods for the training and conditioning. Players are not pleased with his aggressive coaching style.<\/p><p>Injuries have also been a concern for them, and nothing seems to go right for them for now. The things became worse when they lost to the Boston Celtics by 56 points in their last match. It was the biggest loss in franchise history.<\/p><p>The players surely were very disappointed, and according to the <a href=\"http:\/\/www.espn.in\/nba\/story\/_\/id\/25493942\/chicago-bulls-players-push-back-coach-jim-boylen-aggressive-style\" target=\"_blank\">Malika Andrews of ESPN<\/a>, players held a \"Players-only meeting\" before the practice.<\/p><p><strong>Below is what the report has to say:<\/strong><\/p><blockquote>Some Bulls players pushed back on Boylen's aggressive coaching style. After suffering the worst loss in franchise history Saturday night, Zach LaVine and Justin Holiday led a two-hour, players-only meeting in lieu of the practice Boylen had planned for the team Sunday.<\/blockquote><p>There were also reports that players wanted to skip the practice, but few Veterans urged everybody to come and have a meeting.<\/p><p>According to Wendell Carter Jr., players have been straightforward and honest with the coach and management, which might be a positive sign.<\/p><p>Boylen however, is being confident that he and the players will get on the same path.<\/p><blockquote>\"We're still learning about each other,\" Boylen said. \"I've moved over the 18 inches [from one chair on the bench to the next]. They're still learning how I want it. There's been a little shock and awe here in the last seven days. And there's an adjustment to that.\"<\/blockquote><p>Boylen has been the coach for a very few matches till now, and it is very early to say or predict anything. The win against the OKC brought a lot of praise for him, but the loss did the opposite. So it is very early to judge the man, and we should give him some breathing room.<\/p><p>&#8203;<\/p>",
                        "originalUrl": "https:\/\/www.sportskeeda.com\/basketball\/nba-rumor-chicago-bulls-players-hold-a-meeting-and-nearly-skip-practice"
                    }
                ],
                "tags": [],
                "detailUrl": "https:\/\/www.sportskeeda.com\/basketball\/nba-rumor-chicago-bulls-players-hold-a-meeting-and-nearly-skip-practice",
                "articleFrom": "Sportskeeda",
                "publishTime": 1544452800000,
                "createTime": 1544452800000,
                "coverPic": [
                    "https:\/\/static.sportskeeda.com\/editor\/2018\/12\/d4da4-15444478621503-800.jpg"
                ],
                "province": "",
                "city": ""
            },
            {
                "title": "PBL 2018, Ahmedabad Smash Masters: Time Table, Schedule, Venue Details and Match Timings",
                "thumbnail": "https:\/\/static.sportskeeda.com\/editor\/2018\/12\/589c2-15444498266674-800.jpg",
                "created_date": "2018-12-10 20:08:19",
                "modified_date": "2018-12-10 20:08:19",
                "post_date": "Dec 10 2018",
                "TYPE": "article",
                "summary": "Get the complete schedule of Ahmedabad Smash Masters for the Premier Badminton League 2018",
                "author_name": "Rishikesh Malkhede",
                "id": 3027256,
                "language": "English",
                "category": "Sports",
                "subcategory": "Badminton",
                "keywords": "",
                "description": "Get the complete schedule of Ahmedabad Smash Masters for the Premier Badminton League 2018",
                "pages": [
                    {
                        "pageNumber": 1,
                        "pageContent": "<p align=\"justify\">The fourth season of the Premier Badminton League is all set to commence from 22nd December 2018. A new team Pune 7 Aces have been added this season making it a nine team affair. All these nine teams have enough firepower and would be vying for the ultimate goal of winning the title.<\/p><figure class= \"image\"><img src=\"https:\/\/static.sportskeeda.com\/editor\/2018\/12\/589c2-15444498266674-800.jpg\" alt=\"Viktor Axelsen is the highest ranked player for Ahmedabad Smash Masters\" \/><figcaption>Viktor Axelsen is the highest ranked player for Ahmedabad Smash Masters<\/figcaption><\/figure><p align=\"justify\"><\/p><p align=\"justify\">Ahmedabad Smash Masters are returning for their second season this year after a disappointing loss in the semi-final in the first appearance. The franchise is based in Ahmedabad and its home stadium is The Arena by TransStadia. The Ahmedabad based franchise was founded after the second season and is owned by Padmanabh Sports Pvt Ltd.<\/p><p align=\"justify\">After a commendable performance in the inaugural season where they lost a closely contested semi-final game, PBL 2018 could be pivotal for them. Ahmedabad smash masters took a huge risk by not retaining their star from previous season, HS Prannoy. However, their picks this season is more of a mixed bag collections.<\/p><p align=\"justify\">The team has a solid backbone and could prove to be darkhorse in this season. Ahmedabad team has world number three men’s singles player Viktor Axelsen of Denmark as their captain. Their roaster also consists of India’s first choice mixed duo, N Sikki Reddy and Satwiksairaj Rankireddy which could be a difficult proposition to face for opponents in front of the home crowd. Saurabh Verma is the only Indian known face in the men’s singles section.<\/p><p align=\"justify\">The one section where the team could be considered weak is women’s singles, where the only known face is Scotland’s world number 25 Kirsty Gilmour. The completely untested Vaishnavi Bhale is the second women singles player.<\/p><p align=\"justify\">They have a mixed bag and the one visible weakness they have is the lack of strong backup in the singles event. Though, they could still prove their mettle and can shock their way to the finals.<\/p><hr><\/hr><p>Here is a full schedule of their journey in this season of PBL:<\/p><p align=\"justify\"><strong>Match #1<\/strong><\/p><p align=\"justify\">Date: 23 December<\/p><p align=\"justify\">Opponent: North Eastern Warriors<\/p><p align=\"justify\">City: Mumbai<\/p><p align=\"justify\">Timing (IST): 19:00<\/p><p align=\"justify\"><strong>Match #2<\/strong><\/p><p align=\"justify\">Date: 26 December<\/p><p align=\"justify\">Opponent: Delhi Dashers<\/p><p align=\"justify\">City: Hyderabad<\/p><p align=\"justify\">Timing (IST): 19:00<\/p><p align=\"justify\"><strong>Match #3<\/strong><\/p><p align=\"justify\">Date: 28 December<\/p><p align=\"justify\">Opponent: Bengaluru Raptors<\/p><p align=\"justify\">City: Hyderabad<\/p><p align=\"justify\">Timing (IST): 16:00<\/p><p align=\"justify\"><strong>Match #4<\/strong><\/p><p align=\"justify\">Date: 30 December<\/p><p align=\"justify\">Opponent: Chennai Smashers<\/p><p align=\"justify\">City: Pune<\/p><p align=\"justify\">Timing (IST): 16:00<\/p><p align=\"justify\"><strong>Match #5<\/strong><\/p><p align=\"justify\">Date: 4 January<\/p><p align=\"justify\">Opponent: Awadhe Warriors<\/p><p align=\"justify\">City: Ahmedabad<\/p><p align=\"justify\">Timing (IST): 19:00<\/p><p align=\"justify\"><strong>Match #6<\/strong><\/p><p align=\"justify\">Date: 6 January<\/p><p align=\"justify\">Opponent: Hyderabad Hunters<\/p><p align=\"justify\">City: Ahmedabad<\/p><p align=\"justify\">Timing(IST): 19:00<\/p><hr><\/hr><p align=\"justify\">(With inputs from Anubhav Bajpeyee)<\/p><p align=\"justify\"><strong><em>Follow Sportskeeda to get the latest updates and news from <\/em><\/strong><strong><em><a href=\"https:\/\/www.sportskeeda.com\/go\/premier-badminton-league\" target=\"_blank\">Premier Badminton League 2018<\/a><\/em><\/strong><\/p><p>&#8203;<\/p>",
                        "originalUrl": "https:\/\/www.sportskeeda.com\/badminton\/pbl-2018-ahmedabad-smash-masters-time-table-schedule-venue-details-and-match-timings"
                    }
                ],
                "tags": [],
                "detailUrl": "https:\/\/www.sportskeeda.com\/badminton\/pbl-2018-ahmedabad-smash-masters-time-table-schedule-venue-details-and-match-timings",
                "articleFrom": "Sportskeeda",
                "publishTime": 1544452699000,
                "createTime": 1544452699000,
                "coverPic": [
                    "https:\/\/static.sportskeeda.com\/editor\/2018\/12\/589c2-15444498266674-800.jpg"
                ],
                "province": "",
                "city": ""
            },
            {
                "title": "NBA 2018-19: Top 5 Points per game leaders through week eight",
                "thumbnail": "https:\/\/static.sportskeeda.com\/editor\/2018\/12\/818f5-15444521779093-800.jpg",
                "created_date": "2018-12-10 20:07:07",
                "modified_date": "2018-12-10 20:07:07",
                "post_date": "Dec 10 2018",
                "TYPE": "slideshow",
                "summary": "The competition has been ruthless so far this season and a lot of familiar faces steal the limelight.",
                "author_name": "Kaushik Turlapaty",
                "id": 3027254,
                "language": "English",
                "category": "Sports",
                "subcategory": "Basketball",
                "keywords": "",
                "description": "The competition has been ruthless so far this season and a lot of familiar faces steal the limelight.",
                "pages": [
                    {
                        "pageNumber": 1,
                        "pageContent": "<p>&#8203;<\/p><figure class= \"image\"><img src=\"https:\/\/static.sportskeeda.com\/editor\/2018\/12\/818f5-15444521779093-800.jpg\" alt=\"James Harden\" \/><figcaption>James Harden<\/figcaption><\/figure><p>After eight weeks of NBA action, the Western Conference is a mess and we are still not in a position to predict which teams would eventually make it to the playoffs. While the Toronto Raptors continue their dominance at the top of the ladder in the East, the same cannot be said about the West.<\/p><p>In the stacked western conference, there cannot be any off-nights and the teams know that and the players are bringing out their best every night. In this article, let us take a look at the top five points per game leaders through week eight.<\/p><hr><\/hr><h3><strong>#5 Anthony Davis<\/strong><\/h3><figure class= \"image\"><img src=\"https:\/\/static.sportskeeda.com\/editor\/2018\/12\/bdc35-15444504973427-800.jpg\" alt=\"Anthony Davis continues to shine\" \/><figcaption>Anthony Davis continues to shine<\/figcaption><\/figure><p><strong>Stats:<\/strong> <em>26.9 points, 12.4 rebounds, 4.9 assists, 1.6 steals and 3.0 blocks per game on 50.2 % shooting<\/em><\/p><p>Anthony Davis is one of the top 3 two-way players in the league and after finishing as one of the finalists for Defensive Player of the year and Most Valuable Player last year, he continues to shine and is putting up monster numbers.<\/p><p>'The Brow' has been stuffing the stat sheet since day 1 of the season and is averaging a league-leading 3.0 blocks per game. Despite Davis' heroics, the New Orleans Pelicans are once again struggling to get wins and this should definitely be bothering the franchise.<\/p><p>Using his size and height, Davis is dominating the opposition in the paint and posing problems to the defenders. He is doing a great job from the free-throw line as well and it is high time that others showed up for the Pelicans. With the kind of talent that this team has, the sky is the limit and the sooner they realize their potential, the better.<\/p><p>The 25-year old's highest-scoring game of this season came against the New York Knicks at home. He scored game-high 43 points that night to lead the Pelicans past the Knicks.<\/p><p>&#8203;<\/p><!--nextpage--><h3><strong>#4 Damian Lillard<\/strong><\/h3><figure class= \"image\"><img src=\"https:\/\/static.sportskeeda.com\/editor\/2018\/12\/0a406-15444482316595-800.jpg\" alt=\"Damian Lillard's show continues in Portland\" \/><figcaption>Damian Lillard's show continues in Portland<\/figcaption><\/figure><p><strong>Stats:<\/strong> <em>27.2 points, 5.2 rebounds, 6.4 assists, 0.8 steals and 0.5 blocks per game on 44.5 % shooting<\/em><\/p><p>People continue to sleep on Damian Lillard and he continues to put on a show scoring heavily everytime he steps his foot on the court. After averaging 26.9 points, 4.5 rebounds and 6.6 assists per game last season, Lillard picked up where left off and the Blazers are currently at the seventh spot in West.<\/p><p>Lillard started the season hot and averaged close to 30 points in October. Though his numbers fell a bit in the last month, those numbers are still enough to put him on this list. Also, he has been exceptional this month and is averaging 30.8 points per game.<\/p><p>Although the 4-time All-Star has been putting numbers like these from the last 3-4 years, people still somehow seem to turn blind eye to him.<\/p><p>&#8203;<\/p><!--nextpage--><h3><strong>#3 LeBron James<\/strong><\/h3><figure class= \"image\"><img src=\"https:\/\/static.sportskeeda.com\/editor\/2018\/12\/92492-15444477517403-800.jpg\" alt=\"LeBron James is putting up big numbers\" \/><figcaption>LeBron James is putting up big numbers<\/figcaption><\/figure><p><strong>Stats:<\/strong> <em>28.3 points, 7.7 rebounds, 6.9 assists, 1.3 steals and 0.8 blocks per game on 52.1 % shooting<\/em><\/p><p>Playing for a new team does not seem to bother LeBron James or his numbers as he has been stellar so far and is putting up big numbers. The Los Angeles Lakers currently sit on the fifth spot in the Western Conference Standings and the reason is one and only, LeBron James.<\/p><p>He put this team on his back and is carrying every single-night with some breath-taking performances. LeBron, who struggled shooting the ball from behind the arc (27.3 %) in October, is back to being his usual self and shot 42.4 % from long range last month.<\/p><p>The 4-time NBA MVP also had a 50-points game against his former team, Miami Heat. Even though the Lakers struggled early in the season, they are now slowly figuring out things and it will be interesting to see how they perform this season.<\/p><p>&#8203;<\/p><!--nextpage--><h3>#2 Kevin Durant<\/h3><figure class= \"image\"><img src=\"https:\/\/static.sportskeeda.com\/editor\/2018\/12\/3e2b5-15444472669670-800.jpg\" alt=\"Kevin Durant took care of business in the absence of Curry\" \/><figcaption>Kevin Durant took care of business in the absence of Curry<\/figcaption><\/figure><p><strong>Stats:<\/strong> <em>29.1 points, 7.8 rebounds, 6.3 assists, 0.9 steals and 1.1 blocks per game on 51.1 % shooting<\/em><\/p><p>There is no answer for Kevin Durant in the league and he continues to dominate the league. Warriors guard Stephen Curry was absent for the most of November and Durant took care of business in his absence.<\/p><p>Even though Warriors missed Curry and lost several games they would not have lost if they had Steph, the two-time finals MVP was stellar and put on some explosive performances. He had three straight 40 or more points games, including his 51 points performance against the league leaders, Toronto Raptors.<\/p><p>His mid-range jumper has been absolute money so far this season and with Curry back in the lineup, even though his numbers might take a dip, he will definitely be able to express himself more freely.<\/p><p>&#8203;<\/p><!--nextpage--><h3>#1 James Harden<\/h3><figure class= \"image\"><img src=\"https:\/\/static.sportskeeda.com\/editor\/2018\/12\/d5834-15444465895330-800.jpg\" alt=\"James Harden is back at the top\" \/><figcaption>James Harden is back at the top<\/figcaption><\/figure><p><strong>Stats:<\/strong> <em>30.0 points, 5.5 rebounds, 8.3 assists, 2.1 steals and 0.6 blocks per game on 44.2 % shooting<\/em><\/p><p>It took some time but he is back at the top. Even though the Rockets have been struggling this season, one man has been doing what he does the best and that is James Harden. He had 4 40-point games so far, including his 54 points performance against the Washington Wizards on the road.<\/p><p>James Harden struggled from the three-point line in November but that did not stop him from going for 30-points like it is nothing. The defending MVP has been known for drawing contacts all his NBA career and this season is no different, as he is attempting close to 10 free-throws every game.<\/p><p><a href=\"https:\/\/www.sportskeeda.com\/basketball\/5-best-nba-draft-classes-of-all-time\" target=\"_blank\">ALSO READ: 5 Best NBA Draft classes of all time<\/a><\/p><p>The Rockets have not enjoyed much success so far this season and they need to trade for some role players if they want to give themselves a shot at challenging the Golden State Warriors like they did last year.<\/p><p>&#8203;<\/p>",
                        "originalUrl": "https:\/\/www.sportskeeda.com\/basketball\/nba-2018-19-top-5-points-per-game-leaders-through-week-eight"
                    }
                ],
                "tags": [],
                "detailUrl": "https:\/\/www.sportskeeda.com\/basketball\/nba-2018-19-top-5-points-per-game-leaders-through-week-eight",
                "articleFrom": "Sportskeeda",
                "publishTime": 1544452627000,
                "createTime": 1544452627000,
                "coverPic": [
                    "https:\/\/static.sportskeeda.com\/editor\/2018\/12\/818f5-15444521779093-800.jpg"
                ],
                "province": "",
                "city": ""
            },
            {
                "title": "Australia vs India 2018: Should India go with an unchanged side for Perth Test?",
                "thumbnail": "https:\/\/static.sportskeeda.com\/editor\/2018\/12\/4922f-15444520993780-800.jpg",
                "created_date": "2018-12-10 20:05:30",
                "modified_date": "2018-12-10 20:05:30",
                "post_date": "Dec 10 2018",
                "TYPE": "article",
                "summary": "If India opt for the same set of bowlers, they should at least consider having a fifth bowling option in the form of Hanuma Vihari.",
                "author_name": "Amarjeet Nayak",
                "id": 3027253,
                "language": "English",
                "category": "Sports",
                "subcategory": "Cricket",
                "keywords": "",
                "description": "If India opt for the same set of bowlers, they should at least consider having a fifth bowling option in the form of Hanuma Vihari.",
                "pages": [
                    {
                        "pageNumber": 1,
                        "pageContent": "<p>&#8203;<\/p><figure class= \"image\"><img src=\"https:\/\/static.sportskeeda.com\/editor\/2018\/12\/4922f-15444520993780-800.jpg\" alt=\"Australia v India - 1st Test: Day 5\" \/><figcaption>Australia v India - 1st Test: Day 5<\/figcaption><\/figure><p>Ricky Ponting has suggested that despite the loss at Adelaide, Australia should have the same playing eleven at Perth. If a losing side prefers consistency in selection, there is no reason why a winning side should not do the same.<\/p><p>It is very likely that Virat Kohli will opt for an unchanged side at Perth and if he does, there won’t be much debate on that, as a history-making squad should be persisted with by all means.<\/p><p>However, despite the euphoria and the upbeat mood in the Indian camp, the selection of the playing eleven at Perth should not be a foregone conclusion. Kohli and Shastri must give a serious thought to the composition of the squad that will have the best chance to continue the winning run at Perth too.<\/p><p>The four-man Indian bowling attack had to work extremely hard for one and a half days to get the Aussies dismissed in the second innings. Usually, the Indian team under Kohli goes with five bowlers.<\/p><p>But this time they discarded the fifth bowler in favour of a sixth batsman in the form of Rohit Sharma. So, the workload for the four bowlers was significantly more.<\/p><p>With only three days until the Perth Test, is that enough time for the same set of Indian bowlers to get enough rest and be fresh for the second match? What if India has to bowl first? These are critical questions that need to be considered by the Indian think tank before finalizing the playing eleven.<\/p><p>The core of the team, of course, will remain the same. But there are a few slots that need to be reconsidered. With Ashwin getting the last Australian wicket, the debate about his position has been settled. And though he had a heavy workload, being a spinner, the wear and tear on his body should be relatively less compared to the pacers.<\/p><p>Though all three pacers bowled well at Adelaide, India should consider replacing one of them with either Umesh Yadav or Bhuvneshwar Kumar. So, instead of having three bowlers coming out of a tiring outing, they will have at least one pacer who will be fresh. In fact, it is not a bad idea to have a rotation policy for the fast bowlers in the series.<\/p><p>But if India goes with the same set of bowlers, they should at least consider having a fifth bowling option in the form of Hanuma Vihari who could replace Rohit at number six. That way, the batting strength will not be compromised and Kohli will not have to depend on the not-even-part-time bowling of Murali Vijay to give some rest to his frontline bowlers, as he had to do at Adelaide!<\/p><p>&#8203;<\/p>",
                        "originalUrl": "https:\/\/www.sportskeeda.com\/cricket\/australia-vs-india-2018-should-india-go-with-an-unchanged-side-for-perth-test"
                    }
                ],
                "tags": [],
                "detailUrl": "https:\/\/www.sportskeeda.com\/cricket\/australia-vs-india-2018-should-india-go-with-an-unchanged-side-for-perth-test",
                "articleFrom": "Sportskeeda",
                "publishTime": 1544452530000,
                "createTime": 1544452530000,
                "coverPic": [
                    "https:\/\/static.sportskeeda.com\/editor\/2018\/12\/4922f-15444520993780-800.jpg"
                ],
                "province": "",
                "city": ""
            },
            {
                "title": "3 Best Tag Teams in WWE history",
                "thumbnail": "https:\/\/static.sportskeeda.com\/editor\/2018\/12\/b5c6c-15444522882651-800.jpg",
                "created_date": "2018-12-10 20:01:59",
                "modified_date": "2018-12-10 20:01:59",
                "post_date": "Dec 10 2018",
                "TYPE": "slideshow",
                "summary": "Tag team in WWE history has always been exciting, energetic, and full of passion. ",
                "author_name": "Shariful Haque",
                "id": 3027236,
                "language": "English",
                "category": "Sports",
                "subcategory": "WWE",
                "keywords": "",
                "description": "Tag team in WWE history has always been exciting, energetic, and full of passion. ",
                "pages": [
                    {
                        "pageNumber": 1,
                        "pageContent": "<p>&#8203;<\/p><figure class= \"image\"><img src=\"https:\/\/static.sportskeeda.com\/editor\/2018\/12\/b5c6c-15444522882651-800.jpg\" alt=\"Best in the Business?\" \/><figcaption>Best in the Business?<\/figcaption><\/figure><p>The Tag teams in <a href=\"https:\/\/www.sportskeeda.com\/wwe\" target=\"_blank\">WWE<\/a> history has always been exciting, energetic, and full of passion. Two or more boys with same goal, enthusiasm, attitude, passion, energy, [and the list goes on] can become the best Tag Team champion ever unless and until they show some great chemistry between them and use each other's strength and weakness with perfection.<\/p><p>But the more important part is how they manage themselves, before audience and the entire WWE universe. Since it's a WWE tag team it's necessary for them to show some extraordinary teamwork in order to beat the opponents and win the championships.<\/p><p>There comes a famous quote “Talent wins games, but teamwork and intelligence wins championships.” <\/p><p>Tag tam is not just about beating the the opponents, winning the championships and getting the title but it's also to keep it for longer time and to entertain the audience the best way possible.<\/p><hr><\/hr><h3>#3 D-Generation X<\/h3><figure class= \"image\"><img src=\"https:\/\/static.sportskeeda.com\/editor\/2018\/12\/e02d4-15444420298368-800.jpg\" alt=\"Triple H and Shawn Michael\" \/><figcaption>Triple H and Shawn Michael<\/figcaption><\/figure><p>D-Generation X is definitely one of the greatest groups ever created and they had a great run. D-X knew how to own the crowd they were great on mic and back in attitude era they would make people go crazy with their unique forte and hint of humor and comedy.<\/p><p>\"Ladies and gentlemen, boys and girls, children of all age, D-Generation X proudly presents \" this gives immense positivity, the ginormous amount of entertainment, these two were killing it and this is why they were the best among the rest.<\/p><p>They were one of the most influential groups of the Attitude Era, DX were voted the greatest WWE Tag Team Champions in a 2013 viewer poll. Starting out with Michaels, Helmsley, Chyna, and Rick Rude, they recruited new members like X-Pac and the New Age Outlaws following Michaels hiatus from wrestling and grew into the stable they are so renowned for today.<\/p><p>&#8203;<\/p><!--nextpage--><h3>#2 The Brothers of Destruction<\/h3><figure class= \"image\"><img src=\"https:\/\/static.sportskeeda.com\/editor\/2018\/12\/1b58e-15444448571320-800.jpg\" alt=\"The Undertaker and Kane\" \/><figcaption>The Undertaker and Kane<\/figcaption><\/figure><p>The Undertaker and Kane are also known as The Phenom and The Demon respectively. Without question, The Undertaker and Kane are two of the most destructive forces in WWE history..<\/p><p>When Kane interfered during Taker's Hell in a Cell match against Shawn Michaels at Bad Blood, they became fierce opponents but they have also teamed up to become one of the strongest tandems ever seen in the square.<\/p><p>At Breakdown: In Your House, The Undertaker and Kane simultaneously pin \"Stone Cold\" Steve Austin in a Triple Threat Match for the WWE title. Because of the confusion, the title is vacated.<\/p><p>On January 21st, Kane and The Undertaker team up at Royal Rumble 2001, eliminating a number of Superstars before both ultimately fall short of the victory.<\/p><p>At Raw 1000, when The Undertaker saved Kane from an attack by a horde of jilted Superstars, miffed they were excluded from the event and they officially reunited again.<\/p><p>Their chemistry was amazing and they saved each other when needed. <\/p><p>&#8203;<\/p><!--nextpage--><h3>#1 Team Hell No<\/h3><figure class= \"image\"><img src=\"https:\/\/static.sportskeeda.com\/editor\/2018\/12\/61c33-15444463594665-800.jpg\" alt=\"Daniel Bryan and kane\" \/><figcaption>Daniel Bryan and kane<\/figcaption><\/figure><p>Wrestling has always been entertaining and it was so much fun to its admirers and viewers but when you take two wacky personalities who happen to be polar opposites and put them together, things can get even wilder. Odd-couple pairings don't always work, but when they do, it's some of the best entertainment for your dollar.<\/p><p>These two guys, as a tag team, were so adorable because they were completely polar opposites. One was the DEMON who plays with fire while the other one was purely PESSIMIST whose catchphrase was to loudly exclaim \"No!\" (a reversal of his \"Yes!\" catchphrase). <\/p><p>The team HELL NO came from these two personalities. Hell from the Big Red Machine and No from the Daniel Bryan.<\/p><p>They two were one of the best WWE tag teams in history because their chemistry was something which can be adored and they were so used to entertain people and that's what they were for.<\/p><p>&#8203;<\/p>",
                        "originalUrl": "https:\/\/www.sportskeeda.com\/wwe\/3-best-tag-teams-in-wwe-history"
                    }
                ],
                "tags": [],
                "detailUrl": "https:\/\/www.sportskeeda.com\/wwe\/3-best-tag-teams-in-wwe-history",
                "articleFrom": "Sportskeeda",
                "publishTime": 1544452319000,
                "createTime": 1544452319000,
                "coverPic": [
                    "https:\/\/static.sportskeeda.com\/editor\/2018\/12\/b5c6c-15444522882651-800.jpg"
                ],
                "province": "",
                "city": ""
            },
            {
                "title": "Analysing The Strengths and Weakness of Duke's R.J. Barrett ",
                "thumbnail": "https:\/\/static.sportskeeda.com\/editor\/2018\/12\/896f2-15444502416208-800.jpg",
                "created_date": "2018-12-10 20:00:00",
                "modified_date": "2018-12-10 20:00:00",
                "post_date": "Dec 10 2018",
                "TYPE": "slideshow",
                "summary": "The Duke Blue Devils men’s basketball team features three potential future NBA stars.",
                "author_name": "Jason Mills",
                "id": 3027125,
                "language": "English",
                "category": "Sports",
                "subcategory": "Basketball",
                "keywords": "",
                "description": "The Duke Blue Devils men’s basketball team features three potential future NBA stars.",
                "pages": [
                    {
                        "pageNumber": 1,
                        "pageContent": "<p>&#8203;<\/p><figure class= \"image\"><img src=\"https:\/\/static.sportskeeda.com\/editor\/2018\/12\/896f2-15444502416208-800.jpg\" alt=\"Barrett could be a hot pick in the draft next year\" \/><figcaption>Barrett could be a hot pick in the draft next year<\/figcaption><\/figure><p>The Duke Blue Devils men’s basketball team features three potential future NBA stars. Its also quite possible these three young men could be selected, in the 2019 NBA Draft, first, second, and third, overall. <\/p><p>The Blue Devils have won five NCAA Championships, appeared in 11 Championship games, and made 16 final four appearances.   <\/p><p>Coach Mike Krzyzewski, or Coach “K”, as he is known, has seen many a great talent step, on the court, for Duke, since March, of 1980. <\/p><p>Some of the NBA greats he has coached, in his near 40-year career, at Duke, include, Shane Battier, Carlos Boozer, Elton Brand, Grant Hill, Kyrie Irving, Corey Maggette, Jayson Tatum and Marvin Bagley III. <\/p><p>There are others. This year, Coach K, gets to mold potential stars, like power forward Zion Williamson, R.J. Barrett, and Cameron Reddish. All three young men have had an impact, in the Blue Devils season, as the team is 9-1 currently. <\/p><p>Today we will profile the strengths and weaknesses of R.J. Barrett. Barrett is a Canadian freshman playing small forward, for the Duke Blue Devils.<\/p><p>Barrett is the son of Canadian international Rowan Barrett. Rowan is currently the Executive Vice President and Assistant General Manager for Canada’s national Basketball team. <\/p><p>R.J. gets his basketball pedigree, from his father, Rowan, who, during his playing days, played basketball internationally, in Argentina, Cyprus, Israel, France and Italy.<\/p><p>Rowan, a 6’6 small forward, represented Canada, at the FIBA Ameri-Cup, winning silver, in 1999. Rowan also represented Canada, at the 2000 Summer Olympics, in Sydney Australia. <\/p><p>In 1996, Rowan Barrett went undrafted, although he was eligible, for the NBA Draft. Rowan Barrett was signed, by the Toronto Raptors, in 1997 and again in 1999, by the Raptors, and the Philadelphia 76ers. <\/p><p>Rowan never played in an actual NBA game. This will not be the case for R.J. Barrett, who looks to begin a long prosperous career, in the NBA, starting on June 20th, 2019, at the NBA Draft Night.<\/p><h3>R.J. Barrett’s Strengths:<\/h3><figure class= \"image\"><img src=\"https:\/\/static.sportskeeda.com\/editor\/2018\/12\/dd138-15444370975263-800.jpg\" alt=\"Barrett also shows good offensive awareness, in making good passes, to his teammates\" \/><figcaption>Barrett also shows good offensive awareness, in making good passes, to his teammates<\/figcaption><\/figure><p>The Duke Blue Devils have three big-name collegiate stars. When you watch their games, or highlights, of their games, you cannot focus, on one player, without noticing the other two. R.J. Barrett definitely stands out. <\/p><p>He has good speed and quickness, in the open floor. He runs hard to fill lanes, on the fast break. He finishes extremely well, at the basket and through contact, especially, since he only weighs 202 pounds at 6’7. <\/p><p>Barrett also shows good offensive awareness, in making good passes, to his teammates. <\/p><p>This makes him a possible point forward, at the NBA level. He also shows a strong ability to handle the ball. He often advances the ball the length of the court, before distributing or finishing plays himself. Barrett currently is averaging 4.2 assists per game, through 10 games, with Duke. <\/p><p>Another really strong aspect of his game is his ability to catch and shoot and do so, from long range, as well. Barrett makes 37.3%, of his three-point attempts. <\/p><p>Shooting the three-pointer has become a necessity, for most NBA players. Barrett rebounds well, for a 202 pound, 6”7 small forward. He has recorded 72 rebounds, for an average, of 7.2 per game.<\/p><p>Barrett is averaging 24.2 points per game on 47.9% shooting, from the field, which is a solid shooting percentage. The Duke Blue Devils have three game changers, on their roster, this season and Barrett clearly is one of them.<\/p><h3>R.J. Barrett’s Weaknesses:<\/h3><figure class= \"image\"><img src=\"https:\/\/static.sportskeeda.com\/editor\/2018\/12\/21e85-15444375224096-800.jpg\" alt=\"Barrett's lightweight and slender size may also affect his effectiveness\" \/><figcaption>Barrett's lightweight and slender size may also affect his effectiveness<\/figcaption><\/figure><p>Like his teammate, Zion Williamson, there is not much to nitpick, about Barrett. However, unlike Williamson, who may need to slim down, from his college playing weight, of 285 pounds, when he gets to the NBA, Barrett might want to bulk up. <\/p><p>At 202 pounds, bigger stronger players await Barrett, in the NBA, and Barrett might get pushed around. <\/p><p>Barrett's lightweight and slender size may also affect his effectiveness, of finishing after contact, which he is good at, in college. However, at the NBA level the physicality, of the competition, is greater. <\/p><p>Barrett may also need to work on his free throw shooting. In his 10 games, at Duke, so far, Barrett has connected, on just 63.3%, of his charity stripe attempts.<\/p><p> Barrett does show a strong ability to go the length, of the floor, leading the offence and creating offensive opportunities, for himself and teammates.<\/p><p>However, Duke’s only loss this season came against Gonzaga. With time running out, at the end, of the game, Barrett lost the ball, by getting stripped, in the two-point loss. Barrett may need to work on protecting the ball better, when advancing it, up the court.<\/p><h3> R.J. Barrett may be the second overall pick, at the NBA Draft, in 2019<\/h3><figure class= \"image\"><img src=\"https:\/\/static.sportskeeda.com\/editor\/2018\/12\/c2b7c-15444311666177-800.jpg\" alt=\"R.J. Barrett may be the second man taken, in this trifecta of greatness\" \/><figcaption>R.J. Barrett may be the second man taken, in this trifecta of greatness<\/figcaption><\/figure><p>Coach K and the Duke Blue Devils are mostly concerned, with their collegiate season, and the upcoming March Madness tournament, for right now. However, they may pull off an unusual hat trick, at the 2019 NBA Draft.<\/p><p>Duke University among all its other great accomplishments, at the collegiate level, has provided the NBA, with many a great talent, over the years. <\/p><p>Duke is poised to send the top 3 picks, in the 2019 NBA Draft, into basketball stardom, this coming summer.<\/p><p>R.J. Barrett may be the second man taken, in this trifecta of greatness. Barrett's name, from the Duke Blue Devils, will be called, by NBA Commissioner, Adam Silver, at the 2019 NBA Draft.<\/p><p>The only real question now is, which NBA franchise will have the benefit, of acquiring, a desperately needed talent boost?<\/p><p>For the moment, NBA franchises, like the Phoenix Suns, Atlanta Hawks, Cleveland Cavaliers, Chicago Bulls and the New York Knicks have the strongest chance at landing one, of Duke's, high profile stars.<\/p><p>&#8203;<\/p>",
                        "originalUrl": "https:\/\/www.sportskeeda.com\/basketball\/analysing-the-strengths-and-weakness-of-duke-s-r-j-barrett"
                    }
                ],
                "tags": [],
                "detailUrl": "https:\/\/www.sportskeeda.com\/basketball\/analysing-the-strengths-and-weakness-of-duke-s-r-j-barrett",
                "articleFrom": "Sportskeeda",
                "publishTime": 1544452200000,
                "createTime": 1544452200000,
                "coverPic": [
                    "https:\/\/static.sportskeeda.com\/editor\/2018\/12\/896f2-15444502416208-800.jpg"
                ],
                "province": "",
                "city": ""
            },
            {
                "title": "BWF World Tour Finals 2018: PV Sindhu faces Tai Tzu Ying in group stage",
                "thumbnail": "https:\/\/static.sportskeeda.com\/editor\/2018\/12\/3aad4-15444518905133-800.jpg",
                "created_date": "2018-12-10 19:59:32",
                "modified_date": "2018-12-10 19:59:32",
                "post_date": "Dec 10 2018",
                "TYPE": "article",
                "summary": "PV Sindhu’s quest to win her first title of the 2018 season might hit a roadblock if she isn’t at her very best at the BWF World Tour Finals",
                "author_name": "Sudeshna Banerjee",
                "id": 3027251,
                "language": "English",
                "category": "Sports",
                "subcategory": "Badminton",
                "keywords": "",
                "description": "PV Sindhu’s quest to win her first title of the 2018 season might hit a roadblock if she isn’t at her very best at the BWF World Tour Finals",
                "pages": [
                    {
                        "pageNumber": 1,
                        "pageContent": "<p>&#8203;<\/p><figure class= \"image\"><img src=\"https:\/\/static.sportskeeda.com\/editor\/2018\/12\/3aad4-15444518905133-800.jpg\" alt=\"PV Sindhu\" \/><figcaption>PV Sindhu<\/figcaption><\/figure><p>PV Sindhu’s quest to win her first title of the 2018 season might hit a roadblock if she isn’t at her very best at the BWF World Tour Finals 2018 for she has been placed in a highly competitive group. The 2017 runner-up is in Group A which is headed by the World No. 1 Tai Tzu Ying. Defending champion Akane Yamaguchi too is a part of the same group, which also has the World No. 12 Beiwen Zhang of the USA.<\/p><p>Group B seems relatively easier where former winner Nozomi Okuhara is the highest seed. Former world champion Ratchanok Intanon is also there as well as Fuzhou China Open champion Chen Yufei and World No. 16 Michelle Li.<\/p><p>Sindhu has been to five finals this year, which also includes some major tournaments like the World Championships, the Asian Games and the Commonwealth Games. However, her inability to raise her level at the crunch moments has cost her dearly.<\/p><p>At the India Open, she failed to defend her title, despite having a match point and went down in a gruelling final to none other than Beiwen Zhang, who went on to beat Sindhu yet again at the Denmark Open.<\/p><p>Sindhu is tied 3-3 with Zhang, trails Tai 3-10, leads Yamaguchi 9-4 in the head-to-head records. Yamaguchi does not have a great record against the Indian but it was here at the BWF World Tour Finals last year that she edged Sindhu in three games.<\/p><p>Clearly this is not a good draw for the World No. 6 Indian shuttler.<\/p><h3>Full women’s singles draw<\/h3><p><strong>Group A<\/strong><\/p><p>1. Tai Tzu Ying<\/p><p>2. Akane Yamaguchi<\/p><p>3. Pusarla Venkata Sindhu<\/p><p>4. Beiwen Zhang<\/p><p><strong>Group B<\/strong><\/p><p>1. Nozomi Okuhara<\/p><p>2. Chen Yufei<\/p><p>3. Ratchanok Intanon<\/p><p>4. Michelle Li<\/p><p>Sameer Verma too has an equally uphill task in his maiden appearance at this prestigious event. He put up a fantastic performance to successfully defend his title at the Syed Modi International, which allowed him a berth at the BWF World Tour Finals.<\/p><p>But now the job gets tougher as he faces the irrepressible World No. 1 Kento Momota in Group B, besides Indonesian veteran Tommy Sugiarto and Thai rising star Kantaphon Wangcharoen.<\/p><p>Sameer is tied 1-1 with all three of Sugiarto, Wangcharoen and Momota. But the Japanese struck rich form after Sameer met him for the last time at the Swiss Open in February this year.<\/p><p>Group A in men’s singles has Chou Tien Chen, Anthony Sinisuka Ginting, Shi Yuqi, and Son Wan Ho.<\/p><h3>Full men’s singles draw<\/h3><p><strong>Group A<\/strong><\/p><p>1. Chou Tien Chen<\/p><p>2. Shi Yuqi<\/p><p>3. Son Wan Ho<\/p><p>4. Anthony Sinisuka Ginting<\/p><p><strong>Group B<\/strong><\/p><p>1. Kento Momota<\/p><p>2. Tommy Sugiarto<\/p><p>3. Kantaphon Wangcharoen<\/p><p>4. Sameer Verma<\/p><p>&#8203;<\/p><p>&#8203;<\/p><p>&#8203;<\/p>",
                        "originalUrl": "https:\/\/www.sportskeeda.com\/badminton\/bwf-world-tour-finals-2018-pv-sindhu-faces-tai-tzu-ying-in-group-stage"
                    }
                ],
                "tags": [],
                "detailUrl": "https:\/\/www.sportskeeda.com\/badminton\/bwf-world-tour-finals-2018-pv-sindhu-faces-tai-tzu-ying-in-group-stage",
                "articleFrom": "Sportskeeda",
                "publishTime": 1544452172000,
                "createTime": 1544452172000,
                "coverPic": [
                    "https:\/\/static.sportskeeda.com\/editor\/2018\/12\/3aad4-15444518905133-800.jpg"
                ],
                "province": "",
                "city": ""
            },
            {
                "title": "5 Superstars who you forgot beat Brock Lesnar in WWE",
                "thumbnail": "https:\/\/static.sportskeeda.com\/editor\/2018\/12\/bc06d-15444517000059-800.jpg",
                "created_date": "2018-12-10 19:57:27",
                "modified_date": "2018-12-10 19:57:27",
                "post_date": "Dec 10 2018",
                "TYPE": "slideshow",
                "summary": "Brock Lesnar doesn't lose a lot, but he's lost to a current 205 Live Superstar. ",
                "author_name": "Nishant Jayaram",
                "id": 3027248,
                "language": "English",
                "category": "Sports",
                "subcategory": "WWE",
                "keywords": "",
                "description": "Brock Lesnar doesn't lose a lot, but he's lost to a current 205 Live Superstar. ",
                "pages": [
                    {
                        "pageNumber": 1,
                        "pageContent": "<p>&#8203;<\/p><figure class= \"image\"><img src=\"https:\/\/static.sportskeeda.com\/editor\/2018\/12\/bc06d-15444517000059-800.jpg\" alt=\"Brock Lesnar\" \/><figcaption>Brock Lesnar<\/figcaption><\/figure><p>&#8203;<\/p><p>Monster, beast, champion, undefeatable - these are a few of the words that represent what Brock Lesnar has been for the WWE in the 15 or so years that he's wrestled in the promotion.<\/p><p>The Beast is one of the most dominant wrestlers in the history of the business and a serial winner wherever he has wrestled - WWE, in Japan, or at MMA promotion UFC.<\/p><p>In the WWE, Lesnar has an incredible win record. In the 379 matches that he has wrestled in the promotion since debuting on the March 18th, 2002 episode of RAW, the former WWE World Heavyweight Champion has 274 wins, and just 97 losses in the WWE (as per <a href=\"https:\/\/www.cagematch.net\/?id=2&nr=669&page=22&type=byPromotion&eventType=\" target=\"_blank\">Cagematch.net<\/a>). That is a great record, and the loss number would be even less if tag team matches and dark matches aren't considered.<\/p><p>Lesnar seldom loses to the smaller fish in WWE, and most remember the losses he's had with icons of the WWE world, like The Undertaker, Goldberg or John Cena.<\/p><p>Here are 5 Superstars you may have forgotten who beat Brock Lesnar in the WWE.<\/p><hr><\/hr><h3>#1 Rob van Dam<\/h3><p>On paper, this seems like an unlikely pairing for a match - the powerful and strong Brock Lesnar, against an agile, quick wrestler like Rob van Dam, but the two pulled it off in 2002, in three singles matches.<\/p><p>At the start of Lesnar's career, in his very first year in the WWE business, against several big names; Booker T, The Undertaker, Ric Flair, and Hulk Hogan, to name a few.<\/p><p>Rob Van Dam was one of the most recognisable names in ECW, the star of the show, much like what Lesnar became for the WWE. At the 2002 King Of The Ring, RVD and Lesnar faced off in the finals of the tournament, which Lesnar won.<\/p><p><iframe style=\"max-width:100%\" width=\"500\" height=\"281\" src=\"https:\/\/www.dailymotion.com\/embed\/video\/x1293sy\" frameborder=\"0\" allowfullscreen><\/iframe><\/p><p>The very next day on RAW, the two faced off for the Intercontinental Championship, which was won by DQ by Rob van Dam, who was holding the belt, after Paul Heyman interfered, following which Lesnar brutalised RVD. At Vengeance, RVD once again defeated Lesnar by DQ after Heyman pulled out the referee from the ring.<\/p><p>&#8203;<\/p><!--nextpage--><h3>#2 Spanky (Brian Kendrick)<\/h3><p>&#8203;<\/p><p><iframe style=\"max-width:100%\" width=\"500\" height=\"281\" src=\"https:\/\/www.youtube.com\/embed\/Bh0yH1tVkks\" frameborder=\"0\" allowfullscreen><\/iframe><\/p><p>Current fans may not know this, but 205 Live's Brian Kendrick wrestled in the WWE back in the early 2000s. Kendrick, who was known by the ring name 'Spanky' in the independent scene, even faced Brock Lesnar, and defeated him (although by DQ) in a match on SmackDown back in 2003.<\/p><p>The segment leading up to the match was a hilarious one where Spanky was backstage with Orlando Jordan and Funaki, chugging down bottles of chocolate syrup (as one would do in the WWE locker room). Spanky sprayed some of that syrup on WWE Chairman Vince McMahon, who was incensed by the \"kid\" soiling his pristine suit.<\/p><p>McMahon put Spanky in a match against Lesnar, who was one of the deadliest heels in the business. Lesnar destroyed the current 205 Live Superstar, before brutalising Kendrick with the chair, which gave Kendrick the win.<\/p><p>Lesnar was in a feud with Kurt Angle at the time, and was to face at SummerSlam for the WWE Championship. <\/p><p>&#8203;<\/p><p>&#8203;<\/p><!--nextpage--><h3>#3 Zach Gowen<\/h3><figure class= \"image\"><img src=\"https:\/\/static.sportskeeda.com\/editor\/2018\/12\/35f1a-15444519685389-800.jpg\" alt=\"Zacl\" \/><figcaption>Zacl<\/figcaption><figcaption>Gowen faced Brock Lesnar and beat him<\/figcaption><\/figure><p>&#8203;<\/p><p>The very next week on SmackDown, Lesnar brutalised another opponent in Zach Gowen, the one-legged wrestler, in one of the most controversial matches of all time.<\/p><p>Many wrestling fans, to this day, feel that it was inappropriate on the part of the WWE to put a disabled wrestler against Brock Lesnar, and have him completely destroy the young star.<\/p><p>Just days before his high-profile match against Kurt Angle at SummerSlam, Lesnar sent a chilling message to the Olympic hero by brutalising Gowen with a few powerbombs and then smashing his head with a chair, which earned Gowen the win (one of his two singles wins in the WWE; the other was against Matt Hardy).<\/p><p>At SummerSlam, Angle defeated Lesnar and held on to his WWE Championship belt.<\/p><p>The attack on Gowen by Lesnar continued the next week on SmackDown when he was pushed down a flight of stairs by Lesnar.<\/p><p>&#8203;<\/p><p align=\"center\"><\/p><p><iframe style=\"max-width:100%\" width=\"500\" height=\"281\" src=\"https:\/\/www.youtube.com\/embed\/6q7htY6Gi1Y\" frameborder=\"0\" allowfullscreen><\/iframe><\/p><p>&#8203;<\/p><p>&#8203;<\/p><!--nextpage--><h3>#4 The Rock<\/h3><p><iframe style=\"max-width:100%\" width=\"500\" height=\"281\" src=\"https:\/\/www.youtube.com\/embed\/tQpi2ZNh4S0\" frameborder=\"0\" allowfullscreen><\/iframe><\/p><p>Most WWE fans remember Brock Lesnar's first title win, when he won the WWE Undisputed title from The Rock at SummerSlam 2002, to become the youngest champion in the WWE at 25 years of age.<\/p><p>But a few weeks prior to that match, Lesnar was defeated by The Rock, albeit in a triple threat match which also involved Triple H. The Global Warming event in Melbourne, Australia, was for all intents and purposes, a house show (although a DVD of the show was released by the WWE, and then later added to the WWE Network), one of the few live events in Australia back in the early 2000s.<\/p><p>The main event of the show was a match between the Undisputed champion The Rock, and Lesnar and Triple H.<\/p><p>This was the first meeting by The Rock and Lesnar in the ring, and was only one of two matches involving both wrestlers, with the other being at SummerSlam.<\/p><p>In the match, all three wrestlers performed their finishers, but a Rock Bottom on Triple H gave The Rock the victory.<\/p><p>&#8203;<\/p><!--nextpage--><h3>#5 The Big Show<\/h3><p><iframe style=\"max-width:100%\" width=\"500\" height=\"281\" src=\"https:\/\/www.youtube.com\/embed\/RRQ--SCdHKo\" frameborder=\"0\" allowfullscreen><\/iframe><\/p><p>Big Show and Brock Lesnar have faced each other on numerous occasions in the WWE ever since Lesnar made his debut in the promotion back in 2002. But Lesnar's record against The Big Show has been incredibly, losing only once in singles matches.<\/p><p>The only loss for Lesnar against Show was back in 2002 Survivor Series, which was also the show which hosted the first-ever Elimination Chamber match.<\/p><p>Lesnar, who held the WWE Championship (the Undisputed Championship was renamed as the WWE Championship), after winning it from The Rock earlier that year at SummerSlam, was to defend the title once again at Survivor Series in 2002.<\/p><p>Lesnar had defeated The Undertaker at No Mercy, and bragged about how he could never be defeated, to which Big Show challenged him. The two assaulted each other on SmackDown leading up to their Survivor Series match, and at the show, Big Show defeated Lesnar to win the WWE Championship, as well as inflict Lesnar with his first loss by pinfall.<\/p><p>&#8203;<\/p>",
                        "originalUrl": "https:\/\/www.sportskeeda.com\/wwe\/5-superstars-who-you-forgot-won-against-brock-lesnar-wwe"
                    }
                ],
                "tags": [],
                "detailUrl": "https:\/\/www.sportskeeda.com\/wwe\/5-superstars-who-you-forgot-won-against-brock-lesnar-wwe",
                "articleFrom": "Sportskeeda",
                "publishTime": 1544452047000,
                "createTime": 1544452047000,
                "coverPic": [
                    "https:\/\/static.sportskeeda.com\/editor\/2018\/12\/bc06d-15444517000059-800.jpg"
                ],
                "province": "",
                "city": ""
            },
            {
                "title": "Top 5 Xbox One Games For Kids",
                "thumbnail": "https:\/\/static.sportskeeda.com\/editor\/2018\/12\/82d46-15444419158873-800.jpg",
                "created_date": "2018-12-10 19:53:29",
                "modified_date": "2018-12-10 19:53:29",
                "post_date": "Dec 10 2018",
                "TYPE": "slideshow",
                "summary": "A list of Xbox games kids might enjoy.",
                "author_name": "Gautam Nath",
                "id": 3027243,
                "language": "English",
                "category": "Sports",
                "subcategory": "Esports",
                "keywords": "",
                "description": "A list of Xbox games kids might enjoy.",
                "pages": [
                    {
                        "pageNumber": 1,
                        "pageContent": "<p>&#8203;<\/p><figure class= \"image\"><img src=\"https:\/\/static.sportskeeda.com\/editor\/2018\/12\/82d46-15444419158873-800.jpg\" alt=\"Image result for xbox one kids games\" \/><\/figure><p>&#8203;<\/p><p>Plenty of developers are releasing all kinds of games on the Xbox Store. While a lot of them are for teens and adults, there are also some nice games which are available for kids. They provide a stimulating enough experience for a child while also being not so complicated.<\/p><p>Gaming is more often than not an educational experience. Kids can learn the art of resource management, strategy and puzzle solving techniques from games that are challenging enough to their creative and developing minds. Some of these games are pretty fun for people of all ages as well.<\/p><p>In this list, we'll look at some of the best Xbox One video games for kids aged 5 - 10. These games have been received very positively within the gaming community, some of them being remastered classics enjoyed throughout generations.<\/p><hr><\/hr><h3>#5. Spyro Reignited Trilogy<\/h3><figure class= \"image\"><img src=\"https:\/\/static.sportskeeda.com\/editor\/2018\/12\/b3345-15444436990114-800.jpg\" alt=\"Image result for spyro reignited trilogy xbox one\" \/><\/figure><p>&#8203;<\/p><p><strong>US Microsoft Store Price: $39.99<\/strong><\/p><p><strong>India Microsoft Store Price: ₹2,750<\/strong><\/p><p>Anyone who has played the classic PS1 and PS2 games of the trilogy already knows how much nostalgic value this game has. Spyro Reignited Trilogy is a remastered version of the first three Spyro games, namely Spyro the Dragon, Spyro 2: Ripto's Rage! and Spyro: Year of the Dragon. The Reignited Trilogy contains all three games in one copy and is available on Xbox One and PS4.<\/p><p>The game follows the story of the title character Spyro the Dragon and his sidekick dragonfly Sparx. The player explores the fictional world that Spyro lives in, where a nasty spell has been cast on the dragons of the kingdom, turning them to stone. You will need to use strategy and solve many puzzles while exploring the world, sometimes often facing difficult challenges.<\/p><p>This challenging and engaging game is very kid friendly and even very enjoyable for an older audience.<\/p><p>&#8203;<\/p><!--nextpage--><h3>#4. Super Lucky's Tale<\/h3><p>&#8203;<\/p><figure class= \"image\"><img src=\"https:\/\/static.sportskeeda.com\/editor\/2018\/12\/bfc1e-15444454179344-800.jpg\" alt=\"Image result for super lucky's tale\" \/><\/figure><p><strong>US Microsoft Store Price: $19.99<\/strong><\/p><p><strong>India Microsoft Store Price: ₹1,099<\/strong><\/p><p>Super Lucky's Tale is very reminiscent of some classic N64 video games such as Crash Bandicoot. In this game, you play as Lucky the Fox and solve puzzles across four different worlds in different manners. Spanning across 20 levels, each hub features an arena and side-scrolling, coupled with some other challenging puzzles and unlockables. The gameplay is really simple, yet really challenging and very rewarding.<\/p><hr><\/hr><h3>#3. Overcooked 2<\/h3><figure class= \"image\"><img src=\"https:\/\/static.sportskeeda.com\/editor\/2018\/12\/78ce7-15444481001761-800.jpg\" alt=\"Image result for overcooked 2\" \/><\/figure><p>&#8203;<\/p><p><strong>US Microsoft Store Price: $29.99<\/strong><\/p><p><strong>India Microsoft Store Price: ₹1,300<\/strong><\/p><p>Overcooked 2 is a fast-paced cooking themed game, where you and up to 4 players need to deliver as much food as possible within a time frame. There are multiple levels and it progressively starts to get harder. When it gets tricky, even the smartest of grown-ups can slip due to the layout and timing of the game.<\/p><p>The simple animation, simple gameplay mechanics and challenges make it a very family friendly game with coordination learning experiences.<\/p><p>&#8203;<\/p><!--nextpage--><h3>#2. Lego Marvel's Avengers<\/h3><p>&#8203;<\/p><figure class= \"image\"><img src=\"https:\/\/static.sportskeeda.com\/editor\/2018\/12\/810f4-15444496476171-800.jpg\" alt=\"Image result for lego marvel avengers\" \/><\/figure><p>&#8203;<\/p><p><strong>US Microsoft Store Price: $19.99<\/strong><\/p><p><strong>India Microsoft Store Price: ₹3500<\/strong><\/p><p>Lego Marvel's Avengers is a take on the hit film series from the Marvel Cinematic Universe, but with Lego. The game features characters from the movies and Marvel comics. You can play over 200 different characters in the game, including many news ones not featured in the film but in the comics such as Kamala Khan.<\/p><p>Lego Marvel's Avengers is a puzzle based game, where you clear different puzzle-based challenges. Players can travel to New York, South Africa, Sokovia and more. The characters have different specializations and purposes in the puzzle. The boss fights are pretty challenging puzzles as well.<\/p><hr><\/hr><h3>#1. Stardew Valley<\/h3><p>&#8203;<\/p><figure class= \"image\"><img src=\"https:\/\/static.sportskeeda.com\/editor\/2018\/12\/75954-15444507620764-800.jpg\" alt=\"Image result for stardew valley\" \/><\/figure><p><strong>US Microsoft Store Price: $14.99<\/strong><\/p><p><strong>India Microsoft Store Price: ₹940<\/strong><\/p><p>Stardew Valley is one of the best indie games that has been released. The concept is very simple and family friendly, where you control a farmer who has to farm his or her land. It was heavily inspired by an earlier series called Harvest Moon.<\/p><p>In Stardew Valley, the player inherits a farm where they need to grow crops, tend to livestock, maintain their house and social relationships on a daily basis. The player can also explore hidden caves and craft mysterious objects. There is so much to do in this game and so much that you can accomplish inside this virtual world.<\/p><p>&#8203;<\/p>",
                        "originalUrl": "https:\/\/www.sportskeeda.com\/esports\/top-5-best-xbox-one-games-for-kids-ss"
                    }
                ],
                "tags": [],
                "detailUrl": "https:\/\/www.sportskeeda.com\/esports\/top-5-best-xbox-one-games-for-kids-ss",
                "articleFrom": "Sportskeeda",
                "publishTime": 1544451809000,
                "createTime": 1544451809000,
                "coverPic": [
                    "https:\/\/static.sportskeeda.com\/editor\/2018\/12\/82d46-15444419158873-800.jpg"
                ],
                "province": "",
                "city": ""
            },
            {
                "title": "Top 3 UEFA Champions League Finals of this decade",
                "thumbnail": "https:\/\/static.sportskeeda.com\/editor\/2018\/12\/f6a30-15444386204425-800.jpg",
                "created_date": "2018-12-10 19:45:00",
                "modified_date": "2018-12-10 19:45:00",
                "post_date": "Dec 10 2018",
                "TYPE": "slideshow",
                "summary": "These three matches were truly unforgettable.",
                "author_name": "Tanveer Singh Kapoor",
                "id": 3027199,
                "language": "English",
                "category": "Sports",
                "subcategory": "Football",
                "keywords": "",
                "description": "These three matches were truly unforgettable.",
                "pages": [
                    {
                        "pageNumber": 1,
                        "pageContent": "<p>&#8203;<\/p><figure class= \"image\"><img src=\"https:\/\/static.sportskeeda.com\/editor\/2018\/12\/f6a30-15444386204425-800.jpg\" alt=\"Champions League final is one of the most watched sporting events in the world\" \/><figcaption>Champions League final is one of the most watched sporting events in the world<\/figcaption><\/figure><p>The <a href=\"https:\/\/www.sportskeeda.com\/go\/uefa-champions-league\" target=\"_blank\">UEFA Champions League<\/a> is one of the most popular sporting events in the world. Perhaps there isn't anything better than watching 32 teams of Europe compete against each other, fighting to become the best team in the continent.<\/p><p>The Champions League final, being one of the most awaited finals of any sporting event, makes the whole world stop whatever they are doing for 2 hours, sit back, relax and enjoy watching last two remaining sides play in this wonderful competition.<\/p><p>The match never fails to produce some of the most memorable football moments, and is surely an event everybody looks forward to. From listening to the iconic Champions League anthem play inside the stadium to watching the whole game and trophy celebrations, the experience of watching the UEFA Champions League final has always been breathtaking.<\/p><p>We all have seen different types of Champions League finals. Some matches might be one-sided, some matches might be eventless and boring, while some of them wouldn't let you even close your eyes for a second. This decade has been a memorable decade when it comes to Champions League memories as we have watched some of the most eventful, nail-biting and exciting Champions League finals.<\/p><p>Here, we take a look at the top 3 UEFA Champions League finals of this decade.<\/p><p>&#8203;<\/p><h3><strong>#3 Bayern Munich 2-1 Borussia Dortmund (2012-13)<\/strong><\/h3><figure class= \"image\"><img src=\"https:\/\/static.sportskeeda.com\/editor\/2018\/12\/c9d66-15444400917118-800.jpg\" alt=\"Arjen Robben scored a late winner to clinch the Champions League for Bayern Munich in 2013\" \/><figcaption>Arjen Robben scored a late winner to clinch the Champions League for Bayern Munich in 2013<\/figcaption><\/figure><p>It was really Bayern's season in 2012-13 as they beat their arch rivals, Borussia Dortmund to grab the Champions League trophy for the fifth time. It was the first all-German Champions League final in the history of football, and it turned out to be one absolutely thrilling game.<\/p><p>The Croatian star Mario Mandzukic broke the deadlock for the <em>Bavarians <\/em>in the 60th minute, followed by an equalising penalty by Ilkay Gundogan 8 minutes later. The match point arrived when Arjen Robben scored the 89th minute winner to make the score-line 2-1 and ended the final in a nail-biting finish.<\/p><figure class= \"image\"><img src=\"https:\/\/static.sportskeeda.com\/editor\/2018\/12\/33ae0-15444407782369-800.jpg\" alt=\"Bayern's 2012-13 Champions League was for their fifth time.\" \/><figcaption>Bayern's 2012-13 Champions League was for their fifth time<\/figcaption><\/figure><p>It was a night to remember in London as Jupp Heynckes' side not only won the Champions League for the fifth time, but it also completed the treble for the first time and they were the first German side to achieve this. It was a season to remember for Bayern Munich!<\/p><p>&#8203;<\/p><!--nextpage--><h3>#2 Real Madrid 4-1 Atletico Madrid (after extra time) (2013-14)<\/h3><figure class= \"image\"><img src=\"https:\/\/static.sportskeeda.com\/editor\/2018\/12\/1e8a2-15444413562340-800.jpg\" alt=\"Sergio Ramos scored the infamous equaliser in the 93rd minute\" \/><figcaption>Sergio Ramos scored the infamous equaliser in the 93rd minute<\/figcaption><\/figure><p>It was finally <a href=\"https:\/\/www.sportskeeda.com\/team\/real-madrid-cf\" target=\"_blank\">Real Madrid's<\/a> year after 12 years of waiting as they won the <em>La Decima<\/em> in 2014 by beating Atletico Madrid in the final and securing the Champions League title for the tenth time. This final was hosted by the Portuguese capital, Lisbon.<\/p><p>Atletico Madrid opened the scoring as Diego Godin scored in the 36th minute. After several failed attempts at equalizing, Real Madrid finally managed to do so in the 93rd minute, courtesy of <a href=\"https:\/\/www.sportskeeda.com\/player\/sergio-ramos\" target=\"_blank\">Sergio Ramos'<\/a> cracking header from Luka Modric's corner.<\/p><figure class= \"image\"><img src=\"https:\/\/static.sportskeeda.com\/editor\/2018\/12\/acd7a-15444420893333-800.jpg\" alt=\"Real Madrid clinched their 10th Champions League title in 2014\" \/><figcaption>Real Madrid clinched their 10th Champions League title in 2014<\/figcaption><\/figure><p>The match went on to extra time with Real Madrid becoming even more dominant in the last thirty minutes. Real Madrid scored 3 goals in extra time to finish the game by 4-1, with Gareth Bale scoring in the 110th minute, Marcelo scoring in the 118th minute and Cristiano Ronaldo scoring a last minute penalty.<\/p><p>That night in Lisbon was undoubtedly one of the most iconic and memorable moments in the history of Real Madrid.<\/p><p>&#8203;<\/p><!--nextpage--><h3><strong>#3 Chelsea 1-1 Bayern (Chelsea won 4-3 on penalties) (2011-12) <\/strong><\/h3><figure class= \"image\"><img src=\"https:\/\/static.sportskeeda.com\/editor\/2018\/12\/347a7-15444425201731-800.jpg\" alt=\"Didier Drogba scored a late equaliser and the winning penalty for Chelsea.\" \/><figcaption>Didier Drogba scored a late equaliser and the winning penalty for Chelsea.<\/figcaption><\/figure><p>Probably one of the most memorable nights in the history of the Champions League, <a href=\"https:\/\/www.sportskeeda.com\/team\/chelsea\" target=\"_blank\">Chelsea<\/a> shocked everyone on 19th May, 2012 as they beat the German giants Bayern Munich to clinch their first ever Champions League trophy.<\/p><p>It was just not Bayern's night as they could not covert their chances well, hitting 35 shots, but only 7 of them were on target. The German youngster Thomas Muller managed to grab an opener in the 83rd minute, only for <a href=\"https:\/\/www.sportskeeda.com\/player\/didier-drogba\" target=\"_blank\">Didier Drogba<\/a> to equalise five minutes later by heading the ball from Juan Mata's corner.<\/p><figure class= \"image\"><img src=\"https:\/\/static.sportskeeda.com\/editor\/2018\/12\/16d50-15444434987742-800.jpg\" alt=\"Chelsea beat Bayern at their own stadium to win their first ever Champions League\" \/><figcaption>Chelsea beat Bayern at their own stadium to win their first ever Champions League<\/figcaption><\/figure><p>The match moved on to a penalty shootout after an eventless extra time, where Chelsea were able to grab a victory as Bayern could not score their last two penalty kicks, with Ivica Olic's penalty being saved by Petr Cech and Bastian Schweinsteiger hitting the post. Didier Drogba scored a winning penalty to win Chelsea their first Champions League title.<\/p><p>It was an unforgettable night for Chelsea as beating Bayern Munich at Allianz Arena is never easy, and they managed to do it in style.<\/p><p>&#8203;<\/p>",
                        "originalUrl": "https:\/\/www.sportskeeda.com\/football\/top-3-uefa-champions-league-finals-of-this-decade-ss"
                    }
                ],
                "tags": [],
                "detailUrl": "https:\/\/www.sportskeeda.com\/football\/top-3-uefa-champions-league-finals-of-this-decade-ss",
                "articleFrom": "Sportskeeda",
                "publishTime": 1544451300000,
                "createTime": 1544451300000,
                "coverPic": [
                    "https:\/\/static.sportskeeda.com\/editor\/2018\/12\/f6a30-15444386204425-800.jpg"
                ],
                "province": "",
                "city": ""
            },
            {
                "title": "Cristiano Ronaldo News: 'I deserve the Ballon d'Or every year,' claims Juventus superstar",
                "thumbnail": "https:\/\/static.sportskeeda.com\/editor\/2018\/12\/31c6d-15444450045533-800.jpg",
                "created_date": "2018-12-10 19:40:12",
                "modified_date": "2018-12-10 19:40:12",
                "post_date": "Dec 10 2018",
                "TYPE": "article",
                "summary": "Cristiano Ronaldo believes that the Ballon d'Or should've gone to him, not Luka Modric.",
                "author_name": "Shubham Dupare",
                "id": 3027238,
                "language": "English",
                "category": "Sports",
                "subcategory": "Football",
                "keywords": "",
                "description": "Cristiano Ronaldo believes that the Ballon d'Or should've gone to him, not Luka Modric.",
                "pages": [
                    {
                        "pageNumber": 1,
                        "pageContent": "<p>&#8203;<\/p><figure class= \"image\"><img src=\"https:\/\/static.sportskeeda.com\/editor\/2018\/12\/31c6d-15444450045533-800.jpg\" alt=\"Cristiano Ronaldo has spoken up about his Ballon d'Or snub\" \/><figcaption>Cristiano Ronaldo has spoken up about his Ballon d'Or snub<\/figcaption><\/figure><h3>What's the story?<\/h3><p>Five-time <a href=\"https:\/\/www.sportskeeda.com\/football\/ballon-dor\" target=\"_blank\">Ballon d'Or<\/a> winner <a href=\"https:\/\/www.sportskeeda.com\/player\/cristiano-ronaldo\" target=\"_blank\">Cristiano Ronaldo<\/a> has revealed that he feels he should've won the award for a record sixth time this year, in an interview with <em><a href=\"https:\/\/www.gazzetta.it\/Calcio\/Serie-A\/Juventus\/10-12-2018\/ronaldo-la-juventus-come-gruppo-meglio-real-madrid-3101123990664.shtml\" target=\"_blank\">La Gazzetta Dello Sport<\/a><\/em> and the <em><a href=\"http:\/\/www.corrieredellosport.it\/news\/calcio\/serie-a\/juve\/2018\/12\/10-50920947\/cristiano_ronaldo_messi_vieni_in_italia\/\" target=\"_blank\">Corriere Dello Sport<\/a><\/em>.<\/p><p>When asked how he feels about finishing second behind his former <a href=\"https:\/\/www.sportskeeda.com\/team\/real-madrid-cf\" target=\"_blank\">Real Madrid<\/a> teammate <a href=\"https:\/\/www.sportskeeda.com\/player\/luka-modric\" target=\"_blank\">Luka Modric<\/a>, he said that he had done everything on the field to win and that his stats made him a deserving contender for the award.<\/p><p>He further added that because he works very hard on the pitch, he deserves the accolade every year. He vowed to work even harder in the coming year and said that he hopes to see Modric at the event next year too.<\/p><h3>In case you didn't know...<\/h3><p>Luka Modric became the first player in a decade to claim the prestigious award ahead of Ronaldo and <a href=\"https:\/\/www.sportskeeda.com\/team\/barcelona\" target=\"_blank\">Barcelona<\/a> talisman <a href=\"https:\/\/www.sportskeeda.com\/player\/lionel-messi\" target=\"_blank\">Lionel Messi<\/a>, following an outstanding year of football with club and country.<\/p><p>He claimed the prize on the back of a third successive Champions League title with <em>Los Blancos <\/em>and a maiden World Cup final appearance with Croatia.<\/p><p>Ronaldo, who was also part of Madrid's Champions League winning squad, ended up being the competition's top scorer last season. He's been prolific in front of goal and has scored 45 goals in 48 games for club and country in the calendar year.<\/p><h3>The heart of the matter...<\/h3><p>Ronaldo has settled well in Italy with <a href=\"https:\/\/www.sportskeeda.com\/team\/juventus\" target=\"_blank\">Juventus<\/a> and is their current top scorer across all competitions. Following the club's victory in the Derby d'Italia on Saturday, the Portuguese superstar spoke to the Italian media, where he was asked the inescapable question on his Ballon d'Or snub, to which he replied: (via <a href=\"https:\/\/www.marca.com\/en\/football\/international-football\/2018\/12\/10\/5c0e2e70e2704e578d8b4603.html\" target=\"_blank\">MARCA<\/a>)<\/p><blockquote>\"I think I deserve it every year. I work for that, but if I don't win it's not the end of the world. I respect the decision.\"<\/blockquote><blockquote>\"On the field, I have done everything to win, the numbers don't lie, but don't think that I'm less happy if I don't win.\"<\/blockquote><p>He said that though he was disappointed by the outcome, he knows he has to work even harder if he is to have any chance of winning the prize next year. He added:<\/p><blockquote>\"I have great friends and a family, I play for one of the best clubs, you think I go home and start crying? Of course I'm disappointed, but life goes on and I will work even harder.\"<\/blockquote><blockquote>\"Anyway, congratulations to Modric, he deserves it, but next year we'll see each other again and I'll do everything to be there again.\"<\/blockquote><h3>What's next?<\/h3><p>Ronaldo has hit a rich vein of form with the Old Lady and has already scored 11 goals in 19 games for the club.<\/p><p>With Real Madrid and Juventus both poised to finish as the table toppers of their respective groups in the UEFA Champions League, Ronaldo might be up against his former club, with whom he won the competition four times, later in the season.<\/p><p>&#8203;<\/p>",
                        "originalUrl": "https:\/\/www.sportskeeda.com\/football\/cristiano-ronaldo-news-juventus-superstar-claims-i-deserve-the-ballon-d-or-every-year"
                    }
                ],
                "tags": [],
                "detailUrl": "https:\/\/www.sportskeeda.com\/football\/cristiano-ronaldo-news-juventus-superstar-claims-i-deserve-the-ballon-d-or-every-year",
                "articleFrom": "Sportskeeda",
                "publishTime": 1544451012000,
                "createTime": 1544451012000,
                "coverPic": [
                    "https:\/\/static.sportskeeda.com\/editor\/2018\/12\/31c6d-15444450045533-800.jpg"
                ],
                "province": "",
                "city": ""
            },
            {
                "title": "3 features which differentiate Luka Modric and Guti",
                "thumbnail": "https:\/\/static.sportskeeda.com\/editor\/2018\/12\/c456d-15444454867363-800.jpg",
                "created_date": "2018-12-10 19:40:00",
                "modified_date": "2018-12-10 19:40:00",
                "post_date": "Dec 10 2018",
                "TYPE": "article",
                "summary": "3 differences between two important midfielders in the history of Real Madrid.",
                "author_name": "Ninad Singh",
                "id": 3027205,
                "language": "English",
                "category": "Sports",
                "subcategory": "Football",
                "keywords": "",
                "description": "3 differences between two important midfielders in the history of Real Madrid.",
                "pages": [
                    {
                        "pageNumber": 1,
                        "pageContent": "<p>&#8203;<\/p><figure class= \"image\"><img src=\"https:\/\/static.sportskeeda.com\/editor\/2018\/12\/c456d-15444454867363-800.jpg\" alt=\"Are they really alike?\" \/><figcaption>Are they really alike?<\/figcaption><\/figure><p>Two different eras, two different midfielders. While one took his team all the way to the World Cup finals after a fantastic year with his club, the other is regarded as one of the most underrated Real Madrid players of all time.<\/p><p>Surely, the two have been compared on multiple occasions in terms of their appearance, style of play, and leadership qualities, but belonging to different eras and being a part of different squads have drawn out some factors that really set them apart.<\/p><p>Not only do they play in completely different positions in midfield, but their climb up the ladder of the first team has also made them different from each other. Guti started off as a striker, transitioning into a midfielder, and Modric came from being a 'regista' to a central midfielder.<\/p><p>While they may have same passing abilities or dribbling skills, 3 features set them apart totally. However, that does not put aside the fact that the duo have made major contributions to their club's success.<\/p><hr><\/hr><h3>#3 Consistency<\/h3><figure class= \"image\"><img src=\"https:\/\/static.sportskeeda.com\/editor\/2018\/12\/c5966-15444482497153-800.jpg\" alt=\"Guti barely ever was injured, but found it really hard to make an impact\" \/><figcaption>Guti barely ever was injured, but found it really hard to make an impact<\/figcaption><\/figure><p>One of the best things Guti was actually known for was his ability to pass the ball through some of the tightest spaces, creating what was called 'magic moments' for the likes of Ronaldo and Raul.<\/p><p>In fact, playing from a central role and transitioning into an attacking #10 was one of his special qualities. However, unlike Modric, the Spaniard lacked the consistency and the opportunity.<\/p><p>To be specific, Madrid had many reliable options in the form of Zinedine Zidane, which forced Guti to miss out on most of the matches earlier in his career. Guti barely ever was injured, but found it really hard to make an impact.<\/p><blockquote>\"All the doors are closing on me. I was improving as a midfielder, and Zidane arrived. I was improving as a forward and Ronaldo arrived. I'm now in the national team as a midfielder and Beckham comes\" - Guti 2003<\/blockquote><p>The Croatian on the other hand, has been extremely fluid with what he does. Winning 4 Champions League titles with his side, Modric has been more consistent than his counterpart. Featuring in almost all of the major games for Real Madrid is a reflection of his ability to be more fluid with his style of play.<\/p><p>&#8203;<\/p><!--nextpage--><h3>#2 Style of play<\/h3><figure class= \"image\"><img src=\"https:\/\/static.sportskeeda.com\/editor\/2018\/12\/362ad-15444459271193-800.jpg\" alt=\"Modric is a more complete midfielder than Guti\" \/><figcaption>Modric is a more complete midfielder than Guti<\/figcaption><\/figure><p>The most obvious similarities between the two midfielders are their work rate. Both Modric and Guti are sort of like the 'gears' that runs\/ran the machinery of Real Madrid. Quick, agile, and genius, the two are the ideal playmakers when it comes to the midfield. <\/p><p>While Guti played mostly as an attacking midfielder, Modric in recent times has developed into a #10 as well, as was evident with his time with the Croatian national team.<\/p><p>However, their positions aside, they have distinct differences in terms of their style of play. Modric is a typical central midfielder, a midfielder who controls the flow of the game and takes charge of making sure his team does not frail, building the game from the back, playing box to box, as well as using pace and long-range passes. He is regarded as the master of the 'pre-assist'.<\/p><p>Guti on the other hand, was responsible for beating the defence in order to create the attacking opportunity required in order to score goals. His excellent vision as an attacking midfielder made him one of the players with the most number of assists in multiple seasons. <\/p><p>Unlike Modric, the Spaniard would usually situate himself in the midst of the action, waiting for the right opportunity. He was also known for doing the unexpected, such as accurately delivering a pass using the back-heel.<\/p><p>Overall, Modric looks like a more 'complete' midfielder, as he has the ability to play in multiple positions.<\/p><p>&#8203;<\/p><!--nextpage--><h3>#1 Personality<\/h3><figure class= \"image\"><img src=\"https:\/\/static.sportskeeda.com\/editor\/2018\/12\/2ae14-15444460373762-800.jpg\" alt=\"Guti achieved first-team success later in his career\" \/><figcaption>Guti achieved first-team success later in his career<\/figcaption><\/figure><p>While Guti appeared to be taller and stronger, Modric is shorter. In the case of the Croatian, his low centre of gravity has actually allowed him to move past defenders more quickly. Meanwhile, talking about similarities, the duo have always portrayed leadership qualities appreciated by teammates.<\/p><p>Guti was always shy of opportunities due to the presence of Luis Figo or Zinedine Zidane, but he still tried his level best to register himself as one of the foremost Real Madrid midfielders, but was not really able to do it like Luka Modric.<\/p><p>Modric's recruitment in 2012 was questioned by many, but he was quickly able to climb the ladder, as he was not shy of opportunities. His presence on the field has spoken widely for him, as he has played a very important role in the resurrection of Real Madrid in the 2010s.<\/p><p>&#8203;<\/p>",
                        "originalUrl": "https:\/\/www.sportskeeda.com\/football\/3-features-which-differentiate-luka-modric-and-guti-sstl"
                    }
                ],
                "tags": [],
                "detailUrl": "https:\/\/www.sportskeeda.com\/football\/3-features-which-differentiate-luka-modric-and-guti-sstl",
                "articleFrom": "Sportskeeda",
                "publishTime": 1544451000000,
                "createTime": 1544451000000,
                "coverPic": [
                    "https:\/\/static.sportskeeda.com\/editor\/2018\/12\/c456d-15444454867363-800.jpg"
                ],
                "province": "",
                "city": ""
            },
            {
                "title": "3 Reasons why Jason Terry's potential signing is good news for the NBA",
                "thumbnail": "https:\/\/static.sportskeeda.com\/editor\/2018\/12\/91718-15444508491916-800.jpg",
                "created_date": "2018-12-10 19:38:17",
                "modified_date": "2018-12-10 19:38:17",
                "post_date": "Dec 10 2018",
                "TYPE": "slideshow",
                "summary": "It's no joke for a veteran to want to come back, here are some ways he will help if he returns.",
                "author_name": "Avdhi Bhalgat",
                "id": 3027218,
                "language": "English",
                "category": "Sports",
                "subcategory": "Basketball",
                "keywords": "",
                "description": "It's no joke for a veteran to want to come back, here are some ways he will help if he returns.",
                "pages": [
                    {
                        "pageNumber": 1,
                        "pageContent": "<p>&#8203;<\/p><figure class= \"image\"><img src=\"https:\/\/static.sportskeeda.com\/editor\/2018\/12\/91718-15444508491916-800.jpg\" alt=\"Miami Heat v Dallas Mavericks - Game Four\" \/><figcaption>Miami Heat v Dallas Mavericks - Game Four<\/figcaption><\/figure><p>Jason Terry is a big deal in the NBA. He's been playing for 19 seasons now and has been a part of six teams. His average is 13.8 points and 3.8 assists which is higher than average considering he has well over 1400 career games.<\/p><p>This veteran has been playing for the Bucks for the last few seasons, where he averaged 3.3 points and 16 minutes per game making him great on bench support for any team. While he is currently \"retired\", he is still a part of the free agency. Further, he has publically stated that he is willing to come back, given the right offer. The right offer in this situation seems to be only those coming from the Lakers, Warriors or the Mavericks.<\/p><p>Unfortunately, a spot on these BIG 3 teams seems quite unlikely. On the other hand, it is good to know that he won't be leaving this retirement period to start playing for the lottery of teams on the Eastern conference and will just stick to the big guns in the west. Nonetheless, here are some reasons it would be good to have him back.<\/p><hr><\/hr><h3>#1 His shooting prowess<\/h3><figure class= \"image\"><img src=\"https:\/\/static.sportskeeda.com\/editor\/2018\/12\/554bc-15444446758319-800.jpg\" alt=\"Jason Terry Shooting a Three\" \/><figcaption>Jason Terry Shooting a Three<\/figcaption><\/figure><p>There are some glaring holes in Terry's playing style such as his inability to rebound even though he has proven himself as a great defender. But, moving on from those he has proven himself extremely useful on the other side of the court.<\/p><p>To the surprise of many, Terry has held uncountable records in terms of shooting spread across many different parts of his career. As apart of the Celtics, his three-point percentage stood at .380 just behind Allen's make of .400<\/p><p>Even though these numbers have dropped with age and loss of agility, Terry is still extremely reliably with bringing the ball to the ring and with free throws. Especially for the lack of minutes he has gotten off late these numbers still stand impressive.<\/p><p>&#8203;<\/p><p>&#8203;<\/p><p>&#8203;<\/p><!--nextpage--><h3>#2 His on-court experience<\/h3><figure class= \"image\"><img src=\"https:\/\/static.sportskeeda.com\/editor\/2018\/12\/b6a5f-15444447385030-800.jpg\" alt=\"Jason Terry as a part of the Mavericks\" \/><figcaption>Jason Terry as a part of the Mavericks<\/figcaption><\/figure><p>Even in the 2017-2018 season if you were to watch the pre-game shootaround and if you were lucky enough to see his three-pointers you will realize that this is not just any other player. <\/p><p>There are very few players who can claim the number of games he has played (there are only 7 people above his record) and there are also very few players that maintain his skill going into their forties. However, most of all his drive is what makes him so special.<\/p><p>Further, this experience has led to one of the highest game IQ's to be ever seen on an NBA court. He is one of the most illustrated sixth men as well. He has one NBA championship (2011-Dallas), a sixth man of the year trophy (2009), an NCAA championship (Arizona), amongst many other accolades.<\/p><p>&#8203;<\/p><p>&#8203;<\/p><!--nextpage--><h3>#3 The versatility Terry provides<\/h3><figure class= \"image\"><img src=\"https:\/\/static.sportskeeda.com\/editor\/2018\/12\/1fa92-15444448449388-800.jpg\" alt=\"Jason Terry Hopes to Return to the NBA This Season\" \/><figcaption>Jason Terry Hopes to Return to the NBA This Season<\/figcaption><\/figure><p>Over time Jason Terry has played many different roles in the different teams he has been a part of. An excellent first man, he also has had immense potential as a starter in the earlier years of his career. Terry can help out in any place required, provided he is recruited.<\/p><p>Though his shorter built makes him more of a two-guard, Terry has proved extremely competent at playing the point as required. His age and on ground presence have lent him with high basketball IQ that always provides his teammates with not only help but eases the pressure off of younger players. His father-like presence has proven to be helpful to overall team vibe and to ease dressing room tensions while he was a part of the Mavericks over the last few seasons.<\/p><p>&#8203;<\/p><p>&#8203;<\/p><p>&#8203;<\/p><p>&#8203;<\/p>",
                        "originalUrl": "https:\/\/www.sportskeeda.com\/basketball\/3-reasons-why-jason-terry-s-potential-signing-is-good-news-for-the-nba"
                    }
                ],
                "tags": [],
                "detailUrl": "https:\/\/www.sportskeeda.com\/basketball\/3-reasons-why-jason-terry-s-potential-signing-is-good-news-for-the-nba",
                "articleFrom": "Sportskeeda",
                "publishTime": 1544450897000,
                "createTime": 1544450897000,
                "coverPic": [
                    "https:\/\/static.sportskeeda.com\/editor\/2018\/12\/91718-15444508491916-800.jpg"
                ],
                "province": "",
                "city": ""
            },
            {
                "title": "WWE Storyline Update: RAW segment with Alexa Bliss announced before TLC",
                "thumbnail": "https:\/\/static.sportskeeda.com\/editor\/2018\/12\/4cbae-15444482294345-800.jpg",
                "created_date": "2018-12-10 19:38:11",
                "modified_date": "2018-12-10 19:38:11",
                "post_date": "Dec 10 2018",
                "TYPE": "article",
                "summary": "What dirty tricks will The Goddess be up to on RAW?",
                "author_name": "Riju Dasgupta",
                "id": 3027229,
                "language": "English",
                "category": "Sports",
                "subcategory": "WWE",
                "keywords": "",
                "description": "What dirty tricks will The Goddess be up to on RAW?",
                "pages": [
                    {
                        "pageNumber": 1,
                        "pageContent": "<p>&#8203;<\/p><figure class= \"image\"><img src=\"https:\/\/static.sportskeeda.com\/editor\/2018\/12\/4cbae-15444482294345-800.jpg\" alt=\"Do you have questions for Little Miss Bliss?\" \/><figcaption>Do you have questions for Little Miss Bliss?<\/figcaption><\/figure><h3>What's the story?<\/h3><p>TLC is coming our way this weekend, and Alexa Bliss will not be competing, owing to the injuries she's sustained in the ring. There have been conflicting reports about whether she's cleared to compete or not.<\/p><p><a href=\"https:\/\/www.sportskeeda.com\/wwe\" target=\"_blank\">WWE<\/a> has announced that she will be hosting a special press ahead of TLC. Bliss even invited the WWE Universe to send in their questions on Twitter.<\/p><h3>In case you didn't know...<\/h3><p>Alexa Bliss has been hosting segments with Sasha Banks and Bayley these past few weeks on RAW. She is the female Authority figure on RAW, the female counterpart to Baron Corbin.<\/p><p><a href=\"https:\/\/www.sportskeeda.com\/wwe\/wwe-rumor-mill-why-wwe-keeps-booking-alexa-bliss-segments-on-raw\" target=\"_blank\">Rumours<\/a> had emerged backstage that WWE wants to keep her on screen because they absolutely love her. That is why she is given promo segments even though she's currently injured. Expect her to be an important part of the RAW before TLC, coming this weekend.<\/p><h3>The heart of the matter<\/h3><p>Ronda Rousey and Nia Jax are scheduled to be part of the TLC pay-per-view and Alexa Bliss has history with both women. Which is why it is no surprise that she's been thrust into the middle of the storyline, to host a press conference before TLC.<\/p><div class=\"sportskeeda-embed\" data-src=\"twitter\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Since taking over the <a href=\"https:\/\/twitter.com\/hashtag\/Raw?src=hash&amp;ref_src=twsrc%5Etfw\">#Raw<\/a> Women’s division, I’ve put our female Superstars at the forefront of <a href=\"https:\/\/twitter.com\/WWE?ref_src=twsrc%5Etfw\">@WWE<\/a>. So before <a href=\"https:\/\/twitter.com\/NiaJaxWWE?ref_src=twsrc%5Etfw\">@NiaJaxWWE<\/a> and <a href=\"https:\/\/twitter.com\/RondaRousey?ref_src=twsrc%5Etfw\">@RondaRousey<\/a> face off at <a href=\"https:\/\/twitter.com\/hashtag\/WWETLC?src=hash&amp;ref_src=twsrc%5Etfw\">#WWETLC<\/a>, I’m holding a press conference and may actually use some of YOUR questions. Use <a href=\"https:\/\/twitter.com\/hashtag\/AskAlexa?src=hash&amp;ref_src=twsrc%5Etfw\">#AskAlexa<\/a><br>...and make them good. <a href=\"https:\/\/t.co\/ZbXEDFTxQB\">pic.twitter.com\/ZbXEDFTxQB<\/a><\/p>— Lexi Kaufman (@AlexaBliss_WWE) <a href=\"https:\/\/twitter.com\/AlexaBliss_WWE\/status\/1071058869500170240?ref_src=twsrc%5Etfw\">December 7, 2018<\/a><\/blockquote><\/div><p>This was the official communication that WWE put up on their site, inviting those fans to send their questions across to The Goddess. Things are guaranteed to get heated ahead of TLC.<\/p><blockquote>As head of the Raw Women’s division, Alexa Bliss announced via Twitter that she will be holding a press conference this coming Monday in advance of the Raw Women’s Championship Match between Ronda Rousey and Nia Jax at WWE TLC. WWE Universe members can submit their questions for the press conference using #AskAlexa.<\/blockquote><h3><\/h3><h3>What's next?<\/h3><p>RAW comes our way from San Diego, California and we'll bring you live coverage of the entire show. Join us in only a few hours for this explosive event. Will this week's show be any better than last week's?<\/p><hr><\/hr><p><strong>Do you think Alexa Bliss has been a good Authority Figure? Let us know in the comments below.<\/strong><\/p><p>&#8203;<\/p>",
                        "originalUrl": "https:\/\/www.sportskeeda.com\/wwe\/wwe-storyline-update-raw-segment-with-alexa-bliss-announced-before-tlc"
                    }
                ],
                "tags": [],
                "detailUrl": "https:\/\/www.sportskeeda.com\/wwe\/wwe-storyline-update-raw-segment-with-alexa-bliss-announced-before-tlc",
                "articleFrom": "Sportskeeda",
                "publishTime": 1544450891000,
                "createTime": 1544450891000,
                "coverPic": [
                    "https:\/\/static.sportskeeda.com\/editor\/2018\/12\/4cbae-15444482294345-800.jpg"
                ],
                "province": "",
                "city": ""
            }
        ]
    }
}